000100240805    ?H*===============================================================*
000101240805     H*   PROGRAM      : 
000102240805     H*   PROGRAM    : 
000103240805     H*                       TOIS1
000104240805    ?H*===============================================================*
000105240805     H*   CREATION DATE    :  2024/02/15
000106240805     H*   PROGRAMER NAME   :  Y.SUGIYAMA
000107240805    ?H*===============================================================*
000108240805     H*   CHANGE HISTORY   :  ____/__/__
000109240805     H*                    :  _.__________ (___)
000110240805     H*                    : 
000111240805    ?H*---------------------------------------------------------------*
000112240805     H*24/06/28 NOS KAMATA 
000113240805     H*                    
000114240805     H*                    
000115240805     H*                    
000116240805     H*                    
000117240805     H*                    
000118240805     H*                    
000119240805     H*                    
000120240805    ?H*===============================================================*
000121240805     H            Y/                                    1
000122240805    ?F*===============================================================*
000123240805     F*                      
000124240805    ?F*===============================================================*
000125240805    ?F*
000126240805     FTD3520FMCF  E                    WORKSTN      KINFDS #XWSID
000127240805    ?F*---------------------------------------------------------------*
000128240805    ?F*
000129240805    ?F*---------------------------------------------------------------*
000130240805    ?F*
000131240805     F*<<>>
000132240805     FTG1FLL03IF  E           K        DISK
000133240805     F*<<>>
000134240805     FTG2FLL03IF  E           K        DISK
000135240805     F*<<>>
000136240805     FTG1FLL01UF  E           K        DISK
000137240805     F            TG1FLR                            KRENAMETG1FLR1
000138240805     F*<<>>
000139240805     FTG2FLL01UF  E           K        DISK
000140240805     F            TG2FLR                            KRENAMETG2FLR1
000141240805    ?F*---------------------------------------------------------------*
000142240805    ?F*
000143240805     F*
000144240805     FGNMMSP  IF  E           K        DISK
000145240805     F*
000146240805     FMSGFLP  IF  E           K        DISK
000147240805    ?F*---------------------------------------------------------------*
000148240805    ?F*
000149240805    ?F*---------------------------------------------------------------*
000150240805    ?F*
000151240805    ?E*===============================================================*
000152240805     E*                      
000153240805     E*----------------------------------------------------------------
000154240805    ?E*
000155240805     E                    TABKBN  1   3  1  ATABNAM 22
000156240805     E*----------------------------------------------------------------
000157240805    ?E*
000158240805     E*
000159240805     E                    ANO      9999  6 0
000160240805     E*
000161240805     E                    XNO         8  6 0
000162240805     E*
000163240805     E                    A004     9999 10
000164240805     E*
000165240805     E                    A016     9999 30
000166240805     E*
000167240805     E                    ABKN     9999 24
000168240805     E* 
000169240805     E                    AKOZ     9999  7
000170240805     E*
000171240805     E*
000172240805     E                    AFL1     9999  8
000173240805     E*
000174240805     E                    ANKN     9999  6 0
000175240805     E*
000176240805     E                    A001     9999 11
000177240805     E*
000178240805     E                    A011     9999  9 0
000179240805     E*
000180240805     E                    A009     9999  8
000181240805     E*
000182240805     E                    A008     9999  3 0
000183240805     E*
000184240805     E                    A002     9999  6
000185240805    ?I*===============================================================*
000186240805     I*                      
000187240805    ?I*===============================================================*
000188240805    ?I*===============================================================*
000189240805     I*                                                   *
000190240805    ?I*===============================================================*
000191240805    ?I*=======================================================*
000192240805     I*                                           *
000193240805    ?I*=======================================================*
000194240805    ?I*=======================================================*
000195240805     I*                      
000196240805    ?I*=======================================================*
000197240805    ?I*=======================================================*
000198240805     I*                                         *
000199240805    ?I*=======================================================*
000200240805     I*WSID
000201240805     I#XWSID      DS
000202240805     I                                      273 276 XWSID
000203240805     I           SDS
000204240805     I                                      244 247 XWSID2
000205240805     I*
000206240805     I            DS
000207240805     I                                        1  120WSYS
000208240805     I                                        1   60WTIME
000209240805     I                                        7  120WDATE
000210240805     I            DS
000211240805     I                                        1   30WGMGNO
000212240805    ?C*===============================================================*
000213240805     C*                      
000214240805    ?C*===============================================================*
000215240805    ?C*===============================================================*
000216240805     C*         
000217240805    ?C*===============================================================*
000218240805     C*<<>>
000219240805     C                     EXSR ##1ST                      
000220240805     C*
000221240805     C                     EXSR ##MAIN                     
000222240805     C*<<>>
000223240805     C                     EXSR ##END                      
000224240805    ?C*===============================================================*
000225240805     C*          ##1ST  :
000226240805    ?C*===============================================================*
000227240805    ?C           ##1ST     BEGSR
000228240805    ?C*----------------------------------------------------------------
000229240805    ?C*<<>>
000230240805     C*
000231240805     C*
000232240805     C           *ENTRY    PLIST
000233240805     C                     PARM           PKUBUN  1        
000234240805     C* 
000235240805     C                     EXSR INIZSR
000236240805     C* 1=
000237240805     C* 2=
000238240805     C* 3=
000239240805     C*
000240240805     C           PKUBUN    LOKUPTABKBN    TABNAM         10
000241240805B001 C           *IN10     IFEQ '1'
000242240805     C                     MOVELTABNAM    XTKND
000243240805     C                     MOVE TABNAM    XNOT
000244240805E001 C                     ENDIF
000245240805     C                     TIME           WSYS
000246240805     C                     MOVE XWSID     XWSID1
000247240805     C                     MOVE XWSID2    XWSID1
000248240805     C                     EXSR DATASR
000249240805     C                     ENDSR
000251240805     C******************************************
000252240805     C*
000253240805     C*
000254240805     C******************************************
000255240805     C           ##MAIN    BEGSR
000256240805B001 C                     DO   *HIVAL
000257240805     C*
000258240805     C                     WRITETD3520C1
000259240805B002 C           I         IFEQ 0
000260240805     C*
000261240805     C                     Z-ADD165       WGMGNO  30
000262240805     C                     SETON                     99
000263240805     C                     EXSR ##MSG
000264240805X002 C                     ELSE
000265240805     C                     EXSR GSETSR
000266240805     C                     WRITETD3520S1
000267240805E002 C                     END
000268240805     C                     EXFMTTD3520M1
000269240805     C                     SETOF                     515253
000270240805     C                     SETOF                     545556
000271240805     C                     SETOF                     575859
000272240805     C                     SETOF                     606162
000273240805     C                     SETOF                     636465
000274240805     C*------------------------------------------------------
000275240805     C*
000276240805     C                     SETOF                     666768
000277240805     C*
000278240805     C                     SETOF                     99
000279240805     C*------------------------------------------------------
000280240805     C                     SETOF                     84
000281240805     C* CMD1 
000282240805B002 C           *INKA     IFEQ '1'
000283240805     C                     SETON                     LR
000284240805     C                     LEAVE
000285240805X002 C                     ELSE
000286240805     C* CMD9 
000287240805B003 C           *INKI     IFEQ '1'
000288240805     C                     Z-ADD0         PNO              
000289240805     C                     EXSR CALLSR
000290240805     C                     EXSR DATASR
000291240805X003 C                     ELSE
000292240805     C* CMD10 
000293240805B004 C           *INKK     IFEQ '1'
000294240805     C                     CLEARTD3520M1
000295240805X004 C                     ELSE
000296240805     C* CMD11 1
000297240805B005 C           *INKJ     IFEQ '1'
000298240805     C                     CLEARTD3520M1
000299240805     C           ZJ        SUB  16        ZJ      40
000300240805B006 C           ZJ        IFLT 0
000301240805     C                     Z-ADD0         ZJ
000302240805E006 C                     ENDIF
000303240805X005 C                     ELSE
000304240805     C*------------------------------------------------------
000305240805     C*
000306240805     C           I         CABEQ*ZERO     TAG2
000307240805     C*------------------------------------------------------
000308240805     C*=================================================
000309240805     C                     SETOF                     11
000310240805     C                     READ TD3520S1                 11
000311240805     C*------------------------------------------------------
000312240805     C           TAG2      TAG
000313240805     C*------------------------------------------------------
000314240805     C*
000315240805B006 C           XOPT1     IFNE '1'
000316240805     C           XOPT1     ANDNE'D'
000317240805     C           XOPT1     ANDNE' '
000318240805     C                     SETON                     6199
000319240805     C                     Z-ADD27        WGMGNO
000320240805     C                     EXSR ##MSG
000321240805E006 C                     ENDIF
000322240805     C*
000323240805B006 C           XOPT2     IFNE '1'
000324240805     C           XOPT2     ANDNE'D'
000325240805     C           XOPT2     ANDNE' '
000326240805     C                     SETON                     6299
000327240805     C                     Z-ADD27        WGMGNO
000328240805     C                     EXSR ##MSG
000329240805E006 C                     ENDIF
000330240805     C*
000331240805B006 C           XOPT3     IFNE '1'
000332240805     C           XOPT3     ANDNE'D'
000333240805     C           XOPT3     ANDNE' '
000334240805     C                     SETON                     6399
000335240805     C                     Z-ADD27        WGMGNO
000336240805     C                     EXSR ##MSG
000337240805E006 C                     ENDIF
000338240805     C*
000339240805B006 C           XOPT4     IFNE '1'
000340240805     C           XOPT4     ANDNE'D'
000341240805     C           XOPT4     ANDNE' '
000342240805     C                     SETON                     6499
000343240805     C                     Z-ADD27        WGMGNO
000344240805     C                     EXSR ##MSG
000345240805E006 C                     ENDIF
000346240805     C*
000347240805B006 C           XOPT5     IFNE '1'
000348240805     C           XOPT5     ANDNE'D'
000349240805     C           XOPT5     ANDNE' '
000350240805     C                     SETON                     6599
000351240805     C                     Z-ADD27        WGMGNO
000352240805     C                     EXSR ##MSG
000353240805E006 C                     ENDIF
000354240805     C*
000355240805B006 C           XOPT6     IFNE '1'
000356240805     C           XOPT6     ANDNE'D'
000357240805     C           XOPT6     ANDNE' '
000358240805     C                     SETON                     6699
000359240805     C                     Z-ADD27        WGMGNO
000360240805     C                     EXSR ##MSG
000361240805E006 C                     ENDIF
000362240805     C*
000363240805B006 C           XOPT7     IFNE '1'
000364240805     C           XOPT7     ANDNE'D'
000365240805     C           XOPT7     ANDNE' '
000366240805     C                     SETON                     6799
000367240805     C                     Z-ADD27        WGMGNO
000368240805     C                     EXSR ##MSG
000369240805E006 C                     ENDIF
000370240805     C*
000371240805B006 C           XOPT8     IFNE '1'
000372240805     C           XOPT8     ANDNE'D'
000373240805     C           XOPT8     ANDNE' '
000374240805     C                     SETON                     6899
000375240805     C                     Z-ADD27        WGMGNO
000376240805     C                     EXSR ##MSG
000377240805E006 C                     ENDIF
000378240805     C*------------------------------------------------------
000379240805     C*
000380240805     C           *IN99     IFEQ '1'
000381240805     C           ZJ        SUB  8         ZJ
000382240805     C           ZJ        IFLT 0
000383240805     C                     Z-ADD0         ZJ
000384240805     C                     ENDIF
000385240805     C                     ENDIF
000386240805     C*------------------------------------------------------
000387240805B006 C           *IN99     IFEQ '0'
000388240805     C* CMD4 
000389240805B007 C           *INKD     IFEQ '1'
000390240805     C           ZJ        SUB  8         ZJ
000391240805B008 C           ZJ        IFLT 0
000392240805     C                     Z-ADD0         ZJ
000393240805E008 C                     ENDIF
000394240805     C                     EXSR GCHECK
000395240805     C                     EXSR DATASR
000396240805     C                     ELSE
000397240805     C           ZJ        SUB  8         ZJ
000398240805B008 C           ZJ        IFLT 0
000399240805     C                     Z-ADD0         ZJ
000400240805E008 C                     ENDIF
000401240805     C                     SETON                     84
000402240805E007 C                     ENDIF
000403240805E006 C                     ENDIF
000404240805E005 C                     ENDIF
000405240805E004 C                     ENDIF
000406240805E003 C                     ENDIF
000407240805E002 C                     ENDIF
000408240805E001 C                     ENDDO
000409240805     C                     ENDSR
000410240805     C******************************************
000411240805     C*
000412240805     C*
000413240805     C******************************************
000414240805     C           CALLSR    BEGSR
000415240805B001 C           *INKI     IFEQ '1'
000416240805     C                     Z-ADD0         PNO
000417240805     C                     ELSE
000418240805     C                     Z-ADDXNO,N     PNO
000419240805E001 C                     ENDIF
000420240805     C*
000421240805B001 C           PKUBUN    IFEQ '1'
000422240805     C           PKUBUN    OREQ '2'
000423240805     C                     CALL 'TD3522'
000424240805     C                     PARM           PKUBUN  1
000425240805     C                     PARM           PNO     60
000426240805X001 C                     ELSE
000427240805     C*
000428240805B002 C           PKUBUN    IFEQ '3'
000429240805     C                     CALL 'TD3524'
000430240805     C                     PARM           PKUBUN  1
000431240805     C                     PARM           PNO     60
000432240805E002 C                     ENDIF
000433240805E001 C                     ENDIF
000434240805     C                     ENDSR
000435240805     C******************************************
000436240805     C*
000437240805     C*
000438240805     C******************************************
000439240805     C*
000440240805     C*
000441240805     C******************************************
000442240805     C           ##END     BEGSR
000443240805     C                     RETRN
000444240805     C                     ENDSR
000445240805     C******************************************
000446240805     C*
000447240805     C*
000448240805     C******************************************
000449240805     C           ##MSG     BEGSR
000450240805     C*
000451240805     C           WGMGNO    CHAINMSGFLP               71
000452240805B001 C           *IN71     IFEQ '1'
000453240805     C                     MOVE *BLANK    XERMS
000454240805X001 C                     ELSE
000455240805     C                     MOVELMGMGNM    XERMS
000456240805E001 C                     ENDIF
000457240805     C                     ENDSR
000458240805     C******************************************
000459240805     C*
000460240805     C*
000461240805     C******************************************
000462240805     C           SET1      BEGSR
000463240805     C                     EXSR INIZSR
000464240805     C*
000465240805     C           TGKEY     KLIST
000466240805     C                     KFLD           WDTK             
000467240805     C                     KFLD           WKFG             
000468240805     C                     MOVELPKUBUN    WDTK    1        
000469240805     C                     MOVEL'1'       WKFG    1        
000470240805      *=1 
000471240805     C                     EXSR ARSET1
000472240805      *
000473240805      *=0 
000474240805     C                     MOVEL'0'       WKFG             
000475240805     C                     EXSR ARSET1
000476240805      *
000477240805     C                     ENDSR
000478240805     C******************************************
000479240805     C*
000480240805     C*
000481240805     C******************************************
000482240805     C           ARSET1    BEGSR
000483240805     C*
000484240805     C                     SETOF                     11
000485240805     C           TGKEY     SETLLTG1FLL03
000486240805     C*
000487240805B001 C                     DO   *HIVAL
000488240805     C*
000489240805     C           TGKEY     READETG1FLL03                 11
000490240805     C*
000491240805B002 C           *IN11     IFEQ '1'
000492240805     C                     LEAVE
000493240805X002 C                     ELSE
000494240805B003 C           TG1RFG    IFEQ '0'
000495240805     C           TG1DFG    ANDEQ' '
000496240805     C*=0=' '
000497240805     C                     ADD  1         I
000498240805     C                     Z-ADDTG1NO     ANO,I            
000499240805     C                     MOVE TG1004    A004,I           
000500240805     C                     MOVELTG1016    A016,I           
000501240805      *
000502240805      *
000503240805     C                     MOVELTG1024    WBKCD   4
000504240805     C                     MOVELTG1026    WBRCD   3
000505240805     C                     MOVE *BLANK    BKBRNM 24
000506240805     C                     EXSR BANKSR
000507240805     C                     MOVELBKBRNM    ABKN,I
000508240805     C*                    MOVELXKOZA     AKOZ,I
000509240805     C*()
000510240805B004 C           TG1KFG    IFEQ '0'
000511240805     C                     MOVE *BLANK    AFL1,I
000512240805X004 C                     ELSE
000513240805B005 C           TG1KFG    IFEQ '1'
000514240805     C                     MOVEL''AFL1,I
000515240805X005 C                     ELSE
000516240805     C                     MOVEL''AFL1,I
000517240805E005 C                     ENDIF
000518240805E004 C                     ENDIF
000519240805     C                     Z-ADDTG1NKN    ANKN,I           
000520240805     C                     MOVE *BLANK    A001,I           
000521240805     C                     MOVELTG1001    A001,I           
000522240805     C                     Z-ADDTG1011    A011,I           
000523240805     C                     MOVE TG1009    A009,I           
000524240805     C                     Z-ADDTG1008    A008,I           
000525240805B004 C           TG1002    IFEQ '2'
000526240805     C*
000527240805     C                     MOVE ''  A002,I            
000528240805X004 C                     ELSE
000529240805     C                     MOVE *BLANK    A002,I
000530240805E004 C                     ENDIF
000531240805E003 C                     ENDIF
000532240805E002 C                     ENDIF
000533240805E001 C                     ENDDO
000534240805     C                     ENDSR
000535240805     C******************************************
000536240805     C*
000537240805     C*
000538240805     C******************************************
000539240805     C           SET2      BEGSR
000540240805     C                     EXSR INIZSR
000541240805     C*
000542240805     C                     MOVELPKUBUN    WDTK             
000543240805     C*=1 
000544240805     C                     MOVEL'1'       WKFG             
000545240805     C                     EXSR ARSET2
000546240805     C*=0 
000547240805     C                     MOVEL'0'       WKFG             
000548240805     C                     EXSR ARSET2
000549240805     C                     ENDSR
000550240805     C******************************************
000551240805     C*
000552240805     C*
000553240805     C******************************************
000554240805     C           ARSET2    BEGSR
000555240805     C                     SETOF                     11
000556240805     C           TGKEY     SETLLTG1FLL03
000557240805B001 C                     DO   *HIVAL
000558240805     C           TGKEY     READETG1FLL03                 11
000559240805B002 C           *IN11     IFEQ '1'
000560240805     C                     LEAVE
000561240805X002 C                     ELSE
000562240805B003 C           TG1RFG    IFEQ '0'
000563240805     C           TG1DFG    ANDEQ' '
000564240805     C*=0=' '
000565240805     C                     ADD  1         I
000566240805     C                     Z-ADDTG1NO     ANO,I            
000567240805     C                     MOVE TG1004    A004,I           
000568240805     C                     MOVELTG1016    A016,I           
000569240805     C*
000570240805     C                     MOVELTG1024    WBKCD
000571240805     C                     MOVELTG1026    WBRCD
000572240805     C                     MOVE *BLANK    BKBRNM
000573240805     C                     EXSR BANKSR
000574240805     C                     MOVELBKBRNM    ABKN,I
000575240805     C*                    MOVELXKOZA     AKOZ,I
000576240805     C*()
000577240805B004 C           TG1KFG    IFEQ '0'
000578240805     C                     MOVE *BLANK    AFL1,I
000579240805X004 C                     ELSE
000580240805B005 C           TG1KFG    IFEQ '1'
000581240805     C                     MOVEL''AFL1,I
000582240805X005 C                     ELSE
000583240805     C                     MOVEL''AFL1,I
000584240805E005 C                     ENDIF
000585240805E004 C                     ENDIF
000586240805     C                     Z-ADDTG1NKN    ANKN,I           
000587240805     C                     MOVE *BLANK    A001,I           
000588240805     C                     MOVELTG1001    A001,I           
000589240805     C                     Z-ADDTG1011    A011,I           
000590240805     C                     MOVE TG1009    A009,I           
000591240805     C                     Z-ADDTG1008    A008,I           
000592240805     C                     MOVE *BLANK    A002,I           
000593240805E003 C                     ENDIF
000594240805E002 C                     ENDIF
000595240805E001 C                     ENDDO
000596240805     C                     ENDSR
000597240805     C******************************************
000598240805     C*
000599240805     C*
000600240805     C******************************************
000601240805     C           SET3      BEGSR
000602240805     C                     EXSR INIZSR
000603240805     C*
000604240805     C                     MOVEL'1'       WDTK             
000605240805     C*=1 
000606240805     C                     MOVEL'1'       WKFG    1        
000607240805     C                     EXSR ARSET3
000608240805     C*=0 
000609240805     C                     MOVEL'0'       WKFG    1        
000610240805     C                     EXSR ARSET3
000611240805     C                     ENDSR
000612240805     C******************************************
000613240805     C*
000614240805     C*
000615240805     C******************************************
000616240805     C           ARSET3    BEGSR
000617240805      *
000618240805     C                     SETOF                     11
000619240805     C           TGKEY     SETLLTG2FLL03
000620240805      *
000621240805B001 C                     DO   *HIVAL
000622240805     C           TGKEY     READETG2FLL03                 11
000623240805B002 C           *IN11     IFEQ '1'
000624240805     C                     LEAVE
000625240805X002 C                     ELSE
000626240805B003 C           TG2RFG    IFEQ '0'
000627240805     C           TG2DFG    ANDEQ' '
000628240805     C*=0=' '
000629240805     C                     ADD  1         I
000630240805     C                     Z-ADDTG2NO     ANO,I            
000631240805     C                     MOVE TG2004    A004,I           
000632240805     C                     MOVELTG2012    A016,I           
000633240805     C*
000634240805     C                     MOVELTG2014    WBKCD            
000635240805     C                     MOVELTG2016    WBRCD            
000636240805     C                     MOVE *BLANK    BKBRNM           
000637240805     C                     EXSR BANKSR
000638240805     C                     MOVELBKBRNM    ABKN,I
000639240805     C*                    MOVELTG2019    AKOZ,I
000640240805     C*()
000641240805B004 C           TG2KFG    IFEQ '0'
000642240805     C                     MOVE *BLANK    AFL1,I
000643240805X004 C                     ELSE
000644240805B005 C           TG2KFG    IFEQ '1'
000645240805     C                     MOVEL''AFL1,I
000646240805X005 C                     ELSE
000647240805     C                     MOVEL''AFL1,I
000648240805E005 C                     ENDIF
000649240805E004 C                     ENDIF
000650240805     C                     Z-ADDTG2NKN    ANKN,I           
000651240805     C*1020
000652240805     C                     MOVE TG2003    A001,I           
000653240805     C*
000654240805     C                     Z-ADDTG2010    A011,I           
000655240805     C*
000656240805     C                     MOVE TG2008    A009,I           
000657240805     C                     Z-ADD0         A008,I           
000658240805     C                     MOVE *BLANK    A002,I           
000659240805E003 C                     ENDIF
000660240805E002 C                     ENDIF
000661240805E001 C                     ENDDO
000662240805      *
000663240805     C                     ENDSR
000664240805     C******************************************
000665240805     C*
000666240805     C*
000667240805     C******************************************
000668240805     C           BANKSR    BEGSR
000669240805     C*
000670240805     C           BKKEY     KLIST
000671240805     C                     KFLD           WBKCD
000672240805     C                     KFLD           WBRCD
000673240805      *
000674240805     C           BKKEY     CHAINGNMMSP               12
000675240805     C           *IN12     IFEQ '1'
000676240805     C                     MOVE *BLANK    GNGNNM
000677240805     C                     MOVE *BLANK    GNGSNM
000678240805     C                     SETOF                     12
000679240805     C                     ELSE
000680240805     C                     ENDIF
000681240805     C                     MOVELGNGNNM    P@DAT1
000682240805     C                     MOVELGNGSNM    P@DAT2
000683240805     C                     Z-ADD24        P@LEN1  30
000684240805     C*
000685240805     C                     CALL 'SUB010'
000686240805     C                     PARM           P@DAT1100
000687240805     C                     PARM           P@DAT2100
000688240805     C                     PARM           P@DAT3100
000689240805     C                     PARM           P@LEN1  30
000690240805     C                     PARM           P@LEN2  30
000691240805     C                     PARM           P@RE1 256
000692240805     C                     PARM           P@RE2 256
000693240805     C                     PARM           P@RE3 256
000694240805     C                     PARM           P@RTC   2
000695240805     C           P@RTC     IFEQ '00'
000696240805     C                     MOVELP@RE1     BKBRNM
000697240805     C                     ELSE
000698240805     C                     MOVELP@DAT1    BKBRNM
000699240805     C                     ENDIF
000700240805     C                     ENDSR
000701240805     C******************************************
000702240805     C*
000703240805     C*
000704240805     C******************************************
000705240805     C           INIZSR    BEGSR
000706240805     C                     Z-ADD0         I       40
000707240805     C                     Z-ADD0         J       40
000708240805     C                     Z-ADD0         ZJ      40
000709240805     C*
000710240805     C                     CLEARANO
000711240805     C                     CLEARXNO
000712240805     C*
000713240805     C                     CLEARA004
000714240805     C*
000715240805     C                     CLEARA016
000716240805     C*
000717240805     C                     CLEARABKN
000718240805     C* 
000719240805     C                     CLEARAKOZ
000720240805     C*
000721240805     C*
000722240805     C                     CLEARAFL1
000723240805     C*
000724240805     C                     CLEARANKN
000725240805     C*
000726240805     C                     CLEARA011
000727240805     C*
000728240805     C                     CLEARA011
000729240805     C*
000730240805     C                     CLEARA009
000731240805     C*
000732240805     C                     CLEARA008
000733240805     C*
000734240805     C                     CLEARA002
000735240805     C*
000736240805     C                     SETOF                     515253
000737240805     C                     SETOF                     545556
000738240805     C                     SETOF                     5758
000739240805     C                     SETOF                     616263
000740240805     C                     SETOF                     646566
000741240805     C                     SETOF                     676899
000742240805     C                     ENDSR
000743240805     C******************************************
000744240805     C*
000745240805     C*
000746240805     C******************************************
000747240805     C           GSETSR    BEGSR
000748240805     C* 
000749240805     C           ZJ        IFEQ 0
000750240805     C                     Z-ADD0         J       40
000751240805     C                     ELSE
000752240805     C                     Z-ADDZJ        J       40
000753240805     C                     ENDIF
000754240805     C                     ADD  1         J
000755240805     C* OPT
000756240805     C*                    MOVE *BLANK    XOPT1
000757240805     C*
000758240805     C                     Z-ADD1         M       10
000759240805     C                     Z-ADDANO,J     XNO,M
000760240805     C*
000761240805     C                     MOVE A004,J    X0041
000762240805     C*
000763240805     C                     MOVELA016,J    X0161
000764240805     C*
000765240805     C                     MOVELABKN,J    XBKB1
000766240805     C* 
000767240805     C*                    MOVELAKOZ,J    XKOZ1
000768240805     C*
000769240805     C*
000770240805     C                     MOVELAFL1,J    XFLG1
000771240805     C*
000772240805     C                     MOVELANKN,J    XNKN1
000773240805     C*
000774240805     C                     MOVELA001,J    X0011
000775240805     C*
000776240805     C                     Z-ADDA011,J    X0111
000777240805     C*
000778240805     C                     MOVE A009,J    X0091
000779240805     C*
000780240805     C                     MOVELA008,J    X0081
000781240805     C*
000782240805     C                     MOVELA002,J    X0021
000783240805     C*
000784240805     C*8,9(2)
000785240805     C                     ADD  1         J
000786240805     C           J         IFLE I
000787240805     C                     SETON                     52
000788240805     C* OPT
000789240805     C*                    MOVE *BLANK    XOPT2
000790240805     C*
000791240805     C                     Z-ADD2         M
000792240805     C                     Z-ADDANO,J     XNO,M
000793240805     C*
000794240805     C                     MOVE A004,J    X0042
000795240805     C*
000796240805     C                     MOVELA016,J    X0162
000797240805     C*
000798240805     C                     MOVELABKN,J    XBKB2
000799240805     C* 
000800240805     C*                    MOVELAKOZ,J    XKOZ2
000801240805     C*
000802240805     C*
000803240805     C                     MOVELAFL1,J    XFLG2
000804240805     C*
000805240805     C                     MOVELANKN,J    XNKN2
000806240805     C*
000807240805     C                     MOVELA001,J    X0012
000808240805     C*
000809240805     C                     Z-ADDA011,J    X0112
000810240805     C*
000811240805     C                     MOVE A009,J    X0092
000812240805     C*
000813240805     C                     MOVELA008,J    X0082
000814240805     C*
000815240805     C                     MOVELA002,J    X0022
000816240805     C                     ENDIF
000817240805     C*10,11(3)
000818240805     C                     ADD  1         J
000819240805     C           J         IFLE I
000820240805     C                     SETON                     53
000821240805     C* OPT
000822240805     C*
000823240805     C*
000824240805     C                     Z-ADD3         M
000825240805     C                     Z-ADDANO,J     XNO,M
000826240805     C*
000827240805     C                     MOVE A004,J    X0043
000828240805     C*
000829240805     C                     MOVELA016,J    X0163
000830240805     C*
000831240805     C                     MOVELABKN,J    XBKB3
000832240805     C* 
000833240805     C*                    MOVELAKOZ,J    XKOZ3
000834240805     C*
000835240805     C*
000836240805     C                     MOVELAFL1,J    XFLG3
000837240805     C*
000838240805     C                     MOVELANKN,J    XNKN3
000839240805     C*
000840240805     C                     MOVELA001,J    X0013
000841240805     C*
000842240805     C                     Z-ADDA011,J    X0113
000843240805     C*
000844240805     C                     MOVE A009,J    X0093
000845240805     C*
000846240805     C                     MOVELA008,J    X0083
000847240805     C*
000848240805     C                     MOVELA002,J    X0023
000849240805     C                     ENDIF
000850240805     C*12,13(4)
000851240805     C                     ADD  1         J
000852240805     C           J         IFLE I
000853240805     C                     SETON                     54
000854240805     C* OPT
000855240805     C*                    MOVE *BLANK    XOPT4
000856240805     C*
000857240805     C                     Z-ADD4         M
000858240805     C                     Z-ADDANO,J     XNO,M
000859240805     C*
000860240805     C                     MOVE A004,J    X0044
000861240805     C*
000862240805     C                     MOVELA016,J    X0164
000863240805     C*
000864240805     C                     MOVELABKN,J    XBKB4
000865240805     C* 
000866240805     C*                    MOVELAKOZ,J    XKOZ4
000867240805     C*
000868240805     C*
000869240805     C                     MOVELAFL1,J    XFLG4
000870240805     C*
000871240805     C                     MOVELANKN,J    XNKN4
000872240805     C*
000873240805     C                     MOVELA001,J    X0014
000874240805     C*
000875240805     C                     Z-ADDA011,J    X0114
000876240805     C*
000877240805     C                     MOVE A009,J    X0094
000878240805     C*
000879240805     C                     MOVELA008,J    X0084
000880240805     C*
000881240805     C                     MOVELA002,J    X0024
000882240805     C                     ENDIF
000883240805     C*14,15(5)
000884240805     C                     ADD  1         J
000885240805     C           J         IFLE I
000886240805     C                     SETON                     55
000887240805     C* OPT
000888240805     C*                    MOVE *BLANK    XOPT5
000889240805     C*
000890240805     C                     Z-ADD5         M
000891240805     C                     Z-ADDANO,J     XNO,M
000892240805     C*
000893240805     C                     MOVE A004,J    X0045
000894240805     C*
000895240805     C                     MOVELA016,J    X0165
000896240805     C*
000897240805     C                     MOVELABKN,J    XBKB5
000898240805     C* 
000899240805     C*                    MOVELAKOZ,J    XKOZ5
000900240805     C*
000901240805     C*
000902240805     C                     MOVELAFL1,J    XFLG5
000903240805     C*
000904240805     C                     MOVELANKN,J    XNKN5
000905240805     C*
000906240805     C                     MOVELA001,J    X0015
000907240805     C*
000908240805     C                     Z-ADDA011,J    X0115
000909240805     C*
000910240805     C                     MOVE A009,J    X0095
000911240805     C*
000912240805     C                     MOVELA008,J    X0085
000913240805     C*
000914240805     C                     MOVELA002,J    X0025
000915240805     C                     ENDIF
000916240805     C*16,17(6)
000917240805     C                     ADD  1         J
000918240805     C           J         IFLE I
000919240805     C                     SETON                     56
000920240805     C* OPT
000921240805     C*                    MOVE *BLANK    XOPT6
000922240805     C*
000923240805     C                     Z-ADD6         M
000924240805     C                     Z-ADDANO,J     XNO,M
000925240805     C*
000926240805     C                     MOVE A004,J    X0046
000927240805     C*
000928240805     C                     MOVELA016,J    X0166
000929240805     C*
000930240805     C                     MOVELABKN,J    XBKB6
000931240805     C* 
000932240805     C*                    MOVELAKOZ,J    XKOZ6
000933240805     C*
000934240805     C*
000935240805     C                     MOVELAFL1,J    XFLG6
000936240805     C*
000937240805     C                     MOVELANKN,J    XNKN6
000938240805     C*
000939240805     C                     MOVELA001,J    X0016
000940240805     C*
000941240805     C                     Z-ADDA011,J    X0116
000942240805     C*
000943240805     C                     MOVE A009,J    X0096
000944240805     C*
000945240805     C                     MOVELA008,J    X0086
000946240805     C*
000947240805     C                     MOVELA002,J    X0026
000948240805     C                     ENDIF
000949240805     C*18,19(7)
000950240805     C                     ADD  1         J
000951240805     C           J         IFLE I
000952240805     C                     SETON                     57
000953240805     C* OPT
000954240805     C*                    MOVE *BLANK    XOPT7
000955240805     C*
000956240805     C                     Z-ADD7         M
000957240805     C                     Z-ADDANO,J     XNO,M
000958240805     C*
000959240805     C                     MOVE A004,J    X0047
000960240805     C*
000961240805     C                     MOVELA016,J    X0167
000962240805     C*
000963240805     C                     MOVELABKN,J    XBKB7
000964240805     C* 
000965240805     C*                    MOVELAKOZ,J    XKOZ7
000966240805     C*
000967240805     C*
000968240805     C                     MOVELAFL1,J    XFLG7
000969240805     C*
000970240805     C                     MOVELANKN,J    XNKN7
000971240805     C*
000972240805     C                     MOVELA001,J    X0017
000973240805     C*
000974240805     C                     Z-ADDA011,J    X0117
000975240805     C*
000976240805     C                     MOVE A009,J    X0097
000977240805     C*
000978240805     C                     MOVELA008,J    X0087
000979240805     C*
000980240805     C                     MOVELA002,J    X0027
000981240805     C                     ENDIF
000982240805     C*20,21(8)
000983240805     C                     ADD  1         J
000984240805     C           J         IFLE I
000985240805     C                     SETON                     58
000986240805     C* OPT
000987240805     C*                    MOVE *BLANK    XOPT8
000988240805     C*
000989240805     C                     Z-ADD8         M
000990240805     C                     Z-ADDANO,J     XNO,M
000991240805     C*
000992240805     C                     MOVE A004,J    X0048
000993240805     C*
000994240805     C                     MOVELA016,J    X0168
000995240805     C*
000996240805     C                     MOVELABKN,J    XBKB8
000997240805     C* 
000998240805     C*                    MOVELAKOZ,J    XKOZ8
000999240805     C*
001000240805     C*
001001240805     C                     MOVELAFL1,J    XFLG8
001002240805     C*
001003240805     C                     MOVELANKN,J    XNKN8
001004240805     C*
001005240805     C                     MOVELA001,J    X0018
001006240805     C*
001007240805     C                     Z-ADDA011,J    X0118
001008240805     C*
001009240805     C                     MOVE A009,J    X0098
001010240805     C*
001011240805     C                     MOVELA008,J    X0088
001012240805     C*
001013240805     C                     MOVELA002,J    X0028
001014240805     C                     ENDIF
001015240805     C           I         IFGT J
001016240805     C                     SETON                     71
001017240805     C                     ELSE
001018240805     C                     SETOF                     71
001019240805     C                     ENDIF
001020240805     C           J         IFGT 8
001021240805     C                     SETON                     70
001022240805     C                     ELSE
001023240805     C                     SETOF                     70
001024240805     C                     ENDIF
001025240805     C                     Z-ADDJ         ZJ
001026240805     C                     ENDSR
001027240805     C******************************************
001028240805     C*
001029240805     C*
001030240805     C******************************************
001031240805     C           GCHECK    BEGSR
001032240805     C                     Z-ADD0         GN      10
001033240805     C*1
001034240805     C                     Z-ADD1         N       10
001035240805     C           ZJ        ADD  1         K       40
001036240805B001 C           XOPT1     IFEQ '1'
001037240805     C*
001038240805     C                     EXSR CALLSR
001039240805X001 C                     ELSE
001040240805B002 C           XOPT1     IFEQ 'D'
001041240805     C*
001042240805     C                     EXSR DELSR
001043240805B002 C                     ENDIF
001044240805B001 C                     ENDIF
001045240805     C                     MOVE *BLANK    XOPT1
001046240805     C*---------------------------------------------------
001047240805     C*2
001048240805     C           ZJ        ADD  2         K
001049240805     C                     Z-ADD2         N
001050240805B001 C           K         IFLE J
001051240805B002 C           XOPT2     IFEQ '1'
001052240805     C*
001053240805     C                     EXSR CALLSR
001054240805X002 C                     ELSE
001055240805B003 C           XOPT3     IFEQ 'D'
001056240805     C*
001057240805     C                     EXSR DELSR
001058240805B003 C                     ENDIF
001059240805B002 C                     ENDIF
001060240805B001 C                     ENDIF
001061240805     C                     MOVE *BLANK    XOPT2
001062240805     C*---------------------------------------------------
001063240805     C*3
001064240805     C                     Z-ADD3         N       10
001065240805     C           ZJ        ADD  3         K       40
001066240805B001 C           K         IFLE J
001067240805B002 C           XOPT3     IFEQ '1'
001068240805     C*
001069240805     C                     EXSR CALLSR
001070240805X002 C                     ELSE
001071240805B003 C           XOPT3     IFEQ 'D'
001072240805     C*
001073240805     C                     EXSR DELSR
001074240805B003 C                     ENDIF
001075240805B002 C                     ENDIF
001076240805B001 C                     ENDIF
001077240805     C                     MOVE *BLANK    XOPT3
001078240805     C*---------------------------------------------------
001079240805     C*4
001080240805     C                     Z-ADD4         N       10
001081240805     C           ZJ        ADD  4         K       40
001082240805B001 C           K         IFLE J
001083240805B002 C           XOPT4     IFEQ '1'
001084240805     C*
001085240805     C                     EXSR CALLSR
001086240805X002 C                     ELSE
001087240805B003 C           XOPT4     IFEQ 'D'
001088240805     C*
001089240805     C                     EXSR DELSR
001090240805B003 C                     ENDIF
001091240805B002 C                     ENDIF
001092240805B001 C                     ENDIF
001093240805     C                     MOVE *BLANK    XOPT4
001094240805     C*---------------------------------------------------
001095240805     C*5
001096240805     C                     Z-ADD5         N       10
001097240805     C           ZJ        ADD  5         K       40
001098240805B001 C           K         IFLE J
001099240805B002 C           XOPT5     IFEQ '1'
001100240805     C*
001101240805     C                     EXSR CALLSR
001102240805X002 C                     ELSE
001103240805B003 C           XOPT5     IFEQ 'D'
001104240805     C*
001105240805     C                     EXSR DELSR
001106240805B003 C                     ENDIF
001107240805B002 C                     ENDIF
001108240805B001 C                     ENDIF
001109240805     C                     MOVE *BLANK    XOPT5
001110240805     C*---------------------------------------------------
001111240805     C*6
001112240805     C                     Z-ADD6         N       10
001113240805     C           ZJ        ADD  6         K       40
001114240805B001 C           K         IFLE J
001115240805ooo2 C           XOPT6     IFEQ '1'
001116240805     C*
001117240805     C                     EXSR CALLSR
001118240805X002 C                     ELSE
001119240805B003 C           XOPT6     IFEQ 'D'
001120240805     C*
001121240805     C                     EXSR DELSR
001122240805B003 C                     ENDIF
001123240805B002 C                     ENDIF
001124240805B001 C                     ENDIF
001125240805     C                     MOVE *BLANK    XOPT6
001126240805     C*---------------------------------------------------
001127240805     C*7
001128240805     C                     Z-ADD7         N       10
001129240805     C           ZJ        ADD  7         K       40
001130240805B001 C           K         IFLE J
001131240805B002 C           XOPT7     IFEQ '1'
001132240805     C*
001133240805     C                     EXSR CALLSR
001134240805X002 C                     ELSE
001135240805B003 C           XOPT7     IFEQ 'D'
001136240805     C*
001137240805     C                     EXSR DELSR
001138240805B003 C                     ENDIF
001139240805B002 C                     ENDIF
001140240805B001 C                     ENDIF
001141240805     C                     MOVE *BLANK    XOPT7
001142240805     C*---------------------------------------------------
001143240805     C*8
001144240805     C                     Z-ADD8         N       10
001145240805     C           ZJ        ADD  8         K       40
001146240805B001 C           K         IFLE J
001147240805B002 C           XOPT8     IFEQ '1'
001148240805     C*
001149240805     C                     EXSR CALLSR
001150240805X002 C                     ELSE
001151240805B003 C           XOPT8     IFEQ 'D'
001152240805     C*
001153240805     C                     EXSR DELSR
001154240805B003 C                     ENDIF
001155240805B002 C                     ENDIF
001156240805B001 C                     ENDIF
001157240805     C                     MOVE *BLANK    XOPT8
001158240805     C*---------------------------------------------------
001159240805     C                     ENDSR
001160240805     C******************************************
001161240805     C*
001162240805     C*
001163240805     C******************************************
001164240805     C           DELSR     BEGSR
001165240805     C*
001166240805     C                     Z-ADDXNO,N     WNO     60
001167240805B001 C           PKUBUN    IFEQ '1'
001168240805     C           PKUBUN    OREQ '2'
001169240805     C           WNO       CHAINTG1FLL01             91
001170240805B002 C           *IN91     IFEQ '1'
001171240805     C                     SETOF                     91
001172240805X002 C                     ELSE
001173240805     C                     MOVEL'D'       TG1DFG           
001174240805     C           WDATE     ADD  20000000  TG1UPD           
001175240805     C                     Z-ADDWTIME     TG1UPT           
001176240805     C                     MOVELXWSID2    TG1UPW           ID
001177240805     C                     UPDATTG1FLR1
001178240805E002 C                     ENDIF
001179240805X001 C                     ELSE
001180240805B002 C           PKUBUN    IFEQ '3'
001181240805     C           WNO       CHAINTG2FLL01             91
001182240805B003 C           *IN91     IFEQ '1'
001183240805     C                     SETOF                     91
001184240805X003 C                     ELSE
001185240805     C                     MOVEL'D'       TG2DFG           
001186240805     C           WDATE     ADD  20000000  TG2UPD           
001187240805     C                     Z-ADDWTIME     TG2UPT           
001188240805     C                     MOVELXWSID2    TG2UPW           ID
001189240805     C                     UPDATTG2FLR1
001190240805E003 C                     ENDIF
001191240805E002 C                     ENDIF
001192240805E001 C                     ENDIF
001193240805     C                     ENDSR
001194240805     C******************************************
001195240805     C*
001196240805     C*
001197240805     C******************************************
001198240805     C           DATASR    BEGSR
001199240805     C*
001200240805B001 C           PKUBUN    IFEQ '1'
001201240805     C*
001202240805     C                     EXSR SET1
001203240805X001 C                     ELSE
001204240805B002 C           PKUBUN    IFEQ '2'
001205240805     C*
001206240805     C                     EXSR SET2
001207240805X002 C                     ELSE
001208240805     C*
001209240805B003 C           PKUBUN    IFEQ '3'
001210240805     C                     EXSR SET3
001211240805E003 C                     ENDIF
001212240805E002 C                     ENDIF
001213240805E001 C                     ENDIF
001214240805     C                     ENDSR
001215240805     C******************************************
001216240805     C**  24/06/07 NOS.NISHIGAKI *******
001217240805** TABKBN/TABNAM 
0012182408051
0012192408052
0012202408053              ?H*===========
001221240805     H*   PROGRAM      : 
001222240805     H*   PROGRAM    : 
001223240805     H*                       TOIS1
001224240805    ?H*===============================================================*
001225240805     H*   CREATION DATE    :  2024/02/15
001226240805     H*   PROGRAMER NAME   :  Y.SUGIYAMA
001227240805    ?H*===============================================================*
001228240805     H*   CHANGE HISTORY   :  ____/__/__
001229240805     H*                    :  _.__________ (___)
001230240805     H*                    : 
001231240805    ?H*---------------------------------------------------------------*
001232240805     H*24/06/28 NOS KAMATA 
001233240805     H*                    
001234240805     H*                    
001235240805     H*                    
001236240805     H*                    
001237240805     H*                    
001238240805     H*                    
001239240805     H*                    
001240240805    ?H*===============================================================*
001241240805     H            Y/                                    1
001242240805    ?F*===============================================================*
001243240805     F*                      
001244240805    ?F*===============================================================*
001245240805    ?F*
001246240805     FTD3520FMCF  E                    WORKSTN      KINFDS #XWSID
001247240805    ?F*---------------------------------------------------------------*
001248240805    ?F*
001249240805    ?F*---------------------------------------------------------------*
001250240805    ?F*
001251240805     F*<<>>
001252240805     FTG1FLL03IF  E           K        DISK
001253240805     F*<<>>
001254240805     FTG2FLL03IF  E           K        DISK
001255240805     F*<<>>
001256240805     FTG1FLL01UF  E           K        DISK
001257240805     F            TG1FLR                            KRENAMETG1FLR1
001258240805     F*<<>>
001259240805     FTG2FLL01UF  E           K        DISK
001260240805     F            TG2FLR                            KRENAMETG2FLR1
001261240805    ?F*---------------------------------------------------------------*
001262240805    ?F*
001263240805     F*
001264240805     FGNMMSP  IF  E           K        DISK
001265240805     F*
001266240805     FMSGFLP  IF  E           K        DISK
001267240805    ?F*---------------------------------------------------------------*
001268240805    ?F*
001269240805    ?F*---------------------------------------------------------------*
001270240805    ?F*
001271240805    ?E*===============================================================*
001272240805     E*                      
001273240805     E*----------------------------------------------------------------
001274240805    ?E*
001275240805     E                    TABKBN  1   3  1  ATABNAM 22
001276240805     E*----------------------------------------------------------------
001277240805    ?E*
001278240805     E*
001279240805     E                    ANO      9999  6 0
001280240805     E*
001281240805     E                    XNO         8  6 0
001282240805     E*
001283240805     E                    A004     9999 10
001284240805     E*
001285240805     E                    A016     9999 30
001286240805     E*
001287240805     E                    ABKN     9999 24
001288240805     E* 
001289240805     E                    AKOZ     9999  7
001290240805     E*
001291240805     E*
001292240805     E                    AFL1     9999  8
001293240805     E*
001294240805     E                    ANKN     9999  6 0
001295240805     E*
001296240805     E                    A001     9999 11
001297240805     E*
001298240805     E                    A011     9999  9 0
001299240805     E*
001300240805     E                    A009     9999  8
001301240805     E*
001302240805     E                    A008     9999  3 0
001303240805     E*
001304240805     E                    A002     9999  6
001305240805    ?I*===============================================================*
001306240805     I*                      
001307240805    ?I*===============================================================*
001308240805    ?I*===============================================================*
001309240805     I*                                                   *
001310240805    ?I*===============================================================*
001311240805    ?I*=======================================================*
001312240805     I*                                           *
001313240805    ?I*=======================================================*
001314240805    ?I*=======================================================*
001315240805     I*                      
001316240805    ?I*=======================================================*
001317240805    ?I*=======================================================*
001318240805     I*                                         *
001319240805    ?I*=======================================================*
001320240805     I*WSID
001321240805     I#XWSID      DS
001322240805     I                                      273 276 XWSID
001323240805     I           SDS
001324240805     I                                      244 247 XWSID2
001325240805     I*
001326240805     I            DS
001327240805     I                                        1  120WSYS
001328240805     I                                        1   60WTIME
001329240805     I                                        7  120WDATE
001330240805     I            DS
001331240805     I                                        1   30WGMGNO
001332240805    ?C*===============================================================*
001333240805     C*                      
001334240805    ?C*===============================================================*
001335240805    ?C*===============================================================*
001336240805     C*         
001337240805    ?C*===============================================================*
001338240805     C*<<>>
001339240805     C                     EXSR ##1ST                      
001340240805     C*
001341240805     C                     EXSR ##MAIN                     
001342240805     C*<<>>
001343240805     C                     EXSR ##END                      
001344240805    ?C*===============================================================*
001345240805     C*          ##1ST  :
001346240805    ?C*===============================================================*
001347240805    ?C           ##1ST     BEGSR
001348240805    ?C*----------------------------------------------------------------
001349240805    ?C*<<>>
001350240805     C*
001351240805     C*
001352240805     C           *ENTRY    PLIST
001353240805     C                     PARM           PKUBUN  1        
001354240805     C* 
001355240805     C                     EXSR INIZSR
001356240805     C* 1=
001357240805     C* 2=
001358240805     C* 3=
001359240805     C*
001360240805     C           PKUBUN    LOKUPTABKBN    TABNAM         10
001361240805B001 C           *IN10     IFEQ '1'
001362240805     C                     MOVELTABNAM    XTKND
001363240805     C                     MOVE TABNAM    XNOT
001364240805E001 C                     ENDIF
001365240805     C                     TIME           WSYS
001366240805     C                     MOVE XWSID     XWSID1
001367240805     C                     MOVE XWSID2    XWSID1
001368240805     C                     EXSR DATASR
001369240805     C                     ENDSR
001370240805     C******************************************
001371240805     C*
001372240805     C*
001373240805     C******************************************
001374240805     C           ##MAIN    BEGSR
001375240805B001 C                     DO   *HIVAL
001376240805     C*
001377240805     C                     WRITETD3520C1
001378240805B002 C           I         IFEQ 0
001379240805     C*
001380240805     C                     Z-ADD165       WGMGNO  30
001381240805     C                     SETON                     99
001382240805     C                     EXSR ##MSG
001383240805X002 C                     ELSE
001384240805     C                     EXSR GSETSR
001385240805     C                     WRITETD3520S1
001386240805E002 C                     END
001387240805     C                     EXFMTTD3520M1
001388240805     C                     SETOF                     515253
001389240805     C                     SETOF                     545556
001390240805     C                     SETOF                     575859
001391240805     C                     SETOF                     606162
001392240805     C                     SETOF                     636465
001393240805     C*------------------------------------------------------
001394240805     C*
001395240805     C                     SETOF                     666768
001396240805     C*
001397240805     C                     SETOF                     99
001398240805     C*------------------------------------------------------
001399240805     C                     SETOF                     84
001400240805     C* CMD1 
001401240805B002 C           *INKA     IFEQ '1'
001402240805     C                     SETON                     LR
001403240805     C                     LEAVE
001404240805X002 C                     ELSE
001405240805     C* CMD9 
001406240805B003 C           *INKI     IFEQ '1'
001407240805     C                     Z-ADD0         PNO              
001408240805     C                     EXSR CALLSR
001409240805     C                     EXSR DATASR
001410240805X003 C                     ELSE
001411240805     C* CMD10 
001412240805B004 C           *INKK     IFEQ '1'
001413240805     C                     CLEARTD3520M1
001414240805X004 C                     ELSE
001415240805     C* CMD11 1
001416240805B005 C           *INKJ     IFEQ '1'
001417240805     C                     CLEARTD3520M1
001418240805     C           ZJ        SUB  16        ZJ      40
001419240805B006 C           ZJ        IFLT 0
001420240805     C                     Z-ADD0         ZJ
001421240805E006 C                     ENDIF
001422240805X005 C                     ELSE
001423240805     C*------------------------------------------------------
001424240805     C*
001425240805     C           I         CABEQ*ZERO     TAG2
001426240805     C*------------------------------------------------------
001427240805     C*=================================================
001428240805     C                     SETOF                     11
001429240805     C                     READ TD3520S1                 11
001430240805     C*------------------------------------------------------
001431240805     C           TAG2      TAG
001432240805     C*------------------------------------------------------
001433240805     C*
001434240805B006 C           XOPT1     IFNE '1'
001435240805     C           XOPT1     ANDNE'D'
001436240805     C           XOPT1     ANDNE' '
001437240805     C                     SETON                     6199
001438240805     C                     Z-ADD27        WGMGNO
001439240805     C                     EXSR ##MSG
001440240805E006 C                     ENDIF
001441240805     C*
001442240805B006 C           XOPT2     IFNE '1'
001443240805     C           XOPT2     ANDNE'D'
001444240805     C           XOPT2     ANDNE' '
001445240805     C                     SETON                     6299
001446240805     C                     Z-ADD27        WGMGNO
001447240805     C                     EXSR ##MSG
001448240805E006 C                     ENDIF
001449240805     C*
001450240805B006 C           XOPT3     IFNE '1'
001451240805     C           XOPT3     ANDNE'D'
001452240805     C           XOPT3     ANDNE' '
001453240805     C                     SETON                     6399
001454240805     C                     Z-ADD27        WGMGNO
001455240805     C                     EXSR ##MSG
001456240805E006 C                     ENDIF
001457240805     C*
001458240805B006 C           XOPT4     IFNE '1'
001459240805     C           XOPT4     ANDNE'D'
001460240805     C           XOPT4     ANDNE' '
001461240805     C                     SETON                     6499
001462240805     C                     Z-ADD27        WGMGNO
001463240805     C                     EXSR ##MSG
001464240805E006 C                     ENDIF
001465240805     C*
001466240805B006 C           XOPT5     IFNE '1'
001467240805     C           XOPT5     ANDNE'D'
001468240805     C           XOPT5     ANDNE' '
001469240805     C                     SETON                     6599
001470240805     C                     Z-ADD27        WGMGNO
001471240805     C                     EXSR ##MSG
001472240805E006 C                     ENDIF
001473240805     C*
001474240805B006 C           XOPT6     IFNE '1'
001475240805     C           XOPT6     ANDNE'D'
001476240805     C           XOPT6     ANDNE' '
001477240805     C                     SETON                     6699
001478240805     C                     Z-ADD27        WGMGNO
001479240805     C                     EXSR ##MSG
001480240805E006 C                     ENDIF
001481240805     C*
001482240805B006 C           XOPT7     IFNE '1'
001483240805     C           XOPT7     ANDNE'D'
001484240805     C           XOPT7     ANDNE' '
001485240805     C                     SETON                     6799
001486240805     C                     Z-ADD27        WGMGNO
001487240805     C                     EXSR ##MSG
001488240805E006 C                     ENDIF
001489240805     C*
001490240805B006 C           XOPT8     IFNE '1'
001491240805     C           XOPT8     ANDNE'D'
001492240805     C           XOPT8     ANDNE' '
001493240805     C                     SETON                     6899
001494240805     C                     Z-ADD27        WGMGNO
001495240805     C                     EXSR ##MSG
001496240805E006 C                     ENDIF
001497240805     C*------------------------------------------------------
001498240805     C*
001499240805     C           *IN99     IFEQ '1'
001500240805     C           ZJ        SUB  8         ZJ
001501240805     C           ZJ        IFLT 0
001502240805     C                     Z-ADD0         ZJ
001503240805     C                     ENDIF
001504240805     C                     ENDIF
001505240805     C*------------------------------------------------------
001506240805B006 C           *IN99     IFEQ '0'
001507240805     C* CMD4 
001508240805B007 C           *INKD     IFEQ '1'
001509240805     C           ZJ        SUB  8         ZJ
001510240805B008 C           ZJ        IFLT 0
001511240805     C                     Z-ADD0         ZJ
001512240805E008 C                     ENDIF
001513240805     C                     EXSR GCHECK
001514240805     C                     EXSR DATASR
001515240805     C                     ELSE
001516240805     C           ZJ        SUB  8         ZJ
001517240805B008 C           ZJ        IFLT 0
001518240805     C                     Z-ADD0         ZJ
001519240805E008 C                     ENDIF
001520240805     C                     SETON                     84
001521240805E007 C                     ENDIF
001522240805E006 C                     ENDIF
001523240805E005 C                     ENDIF
001524240805E004 C                     ENDIF
001525240805E003 C                     ENDIF
001526240805E002 C                     ENDIF
001527240805E001 C                     ENDDO
001528240805     C                     ENDSR
001529240805     C******************************************
001530240805     C*
001531240805     C*
001532240805     C******************************************
001533240805     C           CALLSR    BEGSR
001534240805B001 C           *INKI     IFEQ '1'
001535240805     C                     Z-ADD0         PNO
001536240805     C                     ELSE
001537240805     C                     Z-ADDXNO,N     PNO
001538240805E001 C                     ENDIF
001539240805     C*
001540240805B001 C           PKUBUN    IFEQ '1'
001541240805     C           PKUBUN    OREQ '2'
001542240805     C                     CALL 'TD3522'
001543240805     C                     PARM           PKUBUN  1
001544240805     C                     PARM           PNO     60
001545240805X001 C                     ELSE
001546240805     C*
001547240805B002 C           PKUBUN    IFEQ '3'
001548240805     C                     CALL 'TD3524'
001549240805     C                     PARM           PKUBUN  1
001550240805     C                     PARM           PNO     60
001551240805E002 C                     ENDIF
001552240805E001 C                     ENDIF
001553240805     C                     ENDSR
001554240805     C******************************************
001555240805     C*
001556240805     C*
001557240805     C******************************************
001558240805     C*
001559240805     C*
001560240805     C******************************************
001561240805     C           ##END     BEGSR
001562240805     C                     RETRN
001563240805     C                     ENDSR
001564240805     C******************************************
001565240805     C*
001566240805     C*
001567240805     C******************************************
001568240805     C           ##MSG     BEGSR
001569240805     C*
001570240805     C           WGMGNO    CHAINMSGFLP               71
001571240805B001 C           *IN71     IFEQ '1'
001572240805     C                     MOVE *BLANK    XERMS
001573240805X001 C                     ELSE
001574240805     C                     MOVELMGMGNM    XERMS
001575240805E001 C                     ENDIF
001576240805     C                     ENDSR
001577240805     C******************************************
001578240805     C*
001579240805     C*
001580240805     C******************************************
001581240805     C           SET1      BEGSR
001582240805     C                     EXSR INIZSR
001583240805     C*
001584240805     C           TGKEY     KLIST
001585240805     C                     KFLD           WDTK             
001586240805     C                     KFLD           WKFG             
001587240805     C                     MOVELPKUBUN    WDTK    1        
001588240805     C                     MOVEL'1'       WKFG    1        
001589240805      *=1 
001590240805     C                     EXSR ARSET1
001591240805      *
001592240805      *=0 
001593240805     C                     MOVEL'0'       WKFG             
001594240805     C                     EXSR ARSET1
001595240805      *
001596240805     C                     ENDSR
001597240805     C******************************************
001598240805     C*
001599240805     C*
001600240805     C******************************************
001601240805     C           ARSET1    BEGSR
001602240805     C*
001603240805     C                     SETOF                     11
001604240805     C           TGKEY     SETLLTG1FLL03
001605240805     C*
001606240805B001 C                     DO   *HIVAL
001607240805     C*
001608240805     C           TGKEY     READETG1FLL03                 11
001609240805     C*
001610240805B002 C           *IN11     IFEQ '1'
001611240805     C                     LEAVE
001612240805X002 C                     ELSE
001613240805B003 C           TG1RFG    IFEQ '0'
001614240805     C           TG1DFG    ANDEQ' '
001615240805     C*=0=' '
001616240805     C                     ADD  1         I
001617240805     C                     Z-ADDTG1NO     ANO,I            
001618240805     C                     MOVE TG1004    A004,I           
001619240805     C                     MOVELTG1016    A016,I           
001620240805      *
001621240805      *
001622240805     C                     MOVELTG1024    WBKCD   4
001623240805     C                     MOVELTG1026    WBRCD   3
001624240805     C                     MOVE *BLANK    BKBRNM 24
001625240805     C                     EXSR BANKSR
001626240805     C                     MOVELBKBRNM    ABKN,I
001627240805     C*                    MOVELXKOZA     AKOZ,I
001628240805     C*()
001629240805B004 C           TG1KFG    IFEQ '0'
001630240805     C                     MOVE *BLANK    AFL1,I
001631240805X004 C                     ELSE
001632240805B005 C           TG1KFG    IFEQ '1'
001633240805     C                     MOVEL''AFL1,I
001634240805X005 C                     ELSE
001635240805     C                     MOVEL''AFL1,I
001636240805E005 C                     ENDIF
001637240805E004 C                     ENDIF
001638240805     C                     Z-ADDTG1NKN    ANKN,I           
001639240805     C                     MOVE *BLANK    A001,I           
001640240805     C                     MOVELTG1001    A001,I           
001641240805     C                     Z-ADDTG1011    A011,I           
001642240805     C                     MOVE TG1009    A009,I           
001643240805     C                     Z-ADDTG1008    A008,I           
001644240805B004 C           TG1002    IFEQ '2'
001645240805     C*
001646240805     C                     MOVE ''  A002,I            
001647240805X004 C                     ELSE
001648240805     C                     MOVE *BLANK    A002,I
001649240805E004 C                     ENDIF
001650240805E003 C                     ENDIF
001651240805E002 C                     ENDIF
001652240805E001 C                     ENDDO
001653240805     C                     ENDSR
001654240805     C******************************************
001655240805     C*
001656240805     C*
001657240805     C******************************************
001658240805     C           SET2      BEGSR
001659240805     C                     EXSR INIZSR
001660240805     C*
001661240805     C                     MOVELPKUBUN    WDTK             
001662240805     C*=1 
001663240805     C                     MOVEL'1'       WKFG             
001664240805     C                     EXSR ARSET2
001665240805     C*=0 
001666240805     C                     MOVEL'0'       WKFG             
001667240805     C                     EXSR ARSET2
001668240805     C                     ENDSR
001669240805     C******************************************
001670240805     C*
001671240805     C*
001672240805     C******************************************
001673240805     C           ARSET2    BEGSR
001674240805     C                     SETOF                     11
001675240805     C           TGKEY     SETLLTG1FLL03
001676240805B001 C                     DO   *HIVAL
001677240805     C           TGKEY     READETG1FLL03                 11
001678240805B002 C           *IN11     IFEQ '1'
001679240805     C                     LEAVE
001680240805X002 C                     ELSE
001681240805B003 C           TG1RFG    IFEQ '0'
001682240805     C           TG1DFG    ANDEQ' '
001683240805     C*=0=' '
001684240805     C                     ADD  1         I
001685240805     C                     Z-ADDTG1NO     ANO,I            
001686240805     C                     MOVE TG1004    A004,I           
001687240805     C                     MOVELTG1016    A016,I           
001688240805     C*
001689240805     C                     MOVELTG1024    WBKCD
001690240805     C                     MOVELTG1026    WBRCD
001691240805     C                     MOVE *BLANK    BKBRNM
001692240805     C                     EXSR BANKSR
001693240805     C                     MOVELBKBRNM    ABKN,I
001694240805     C*                    MOVELXKOZA     AKOZ,I
001695240805     C*()
001696240805B004 C           TG1KFG    IFEQ '0'
001697240805     C                     MOVE *BLANK    AFL1,I
001698240805X004 C                     ELSE
001699240805B005 C           TG1KFG    IFEQ '1'
001700240805     C                     MOVEL''AFL1,I
001701240805X005 C                     ELSE
001702240805     C                     MOVEL''AFL1,I
001703240805E005 C                     ENDIF
001704240805E004 C                     ENDIF
001705240805     C                     Z-ADDTG1NKN    ANKN,I           
001706240805     C                     MOVE *BLANK    A001,I           
001707240805     C                     MOVELTG1001    A001,I           
001708240805     C                     Z-ADDTG1011    A011,I           
001709240805     C                     MOVE TG1009    A009,I           
001710240805     C                     Z-ADDTG1008    A008,I           
001711240805     C                     MOVE *BLANK    A002,I           
001712240805E003 C                     ENDIF
001713240805E002 C                     ENDIF
001714240805E001 C                     ENDDO
001715240805     C                     ENDSR
001716240805     C******************************************
001717240805     C*
001718240805     C*
001719240805     C******************************************
001720240805     C           SET3      BEGSR
001721240805     C                     EXSR INIZSR
001722240805     C*
001723240805     C                     MOVEL'1'       WDTK             
001724240805     C*=1 
001725240805     C                     MOVEL'1'       WKFG    1        
001726240805     C                     EXSR ARSET3
001727240805     C*=0 
001728240805     C                     MOVEL'0'       WKFG    1        
001729240805     C                     EXSR ARSET3
001730240805     C                     ENDSR
001731240805     C******************************************
001732240805     C*
001733240805     C*
001734240805     C******************************************
001735240805     C           ARSET3    BEGSR
001736240805      *
001737240805     C                     SETOF                     11
001738240805     C           TGKEY     SETLLTG2FLL03
001739240805      *
001740240805B001 C                     DO   *HIVAL
001741240805     C           TGKEY     READETG2FLL03                 11
001742240805B002 C           *IN11     IFEQ '1'
001743240805     C                     LEAVE
001744240805X002 C                     ELSE
001745240805B003 C           TG2RFG    IFEQ '0'
001746240805     C           TG2DFG    ANDEQ' '
001747240805     C*=0=' '
001748240805     C                     ADD  1         I
001749240805     C                     Z-ADDTG2NO     ANO,I            
001750240805     C                     MOVE TG2004    A004,I           
001751240805     C                     MOVELTG2012    A016,I           
001752240805     C*
001753240805     C                     MOVELTG2014    WBKCD            
001754240805     C                     MOVELTG2016    WBRCD            
001755240805     C                     MOVE *BLANK    BKBRNM           
001756240805     C                     EXSR BANKSR
001757240805     C                     MOVELBKBRNM    ABKN,I
001758240805     C*                    MOVELTG2019    AKOZ,I
001759240805     C*()
001760240805B004 C           TG2KFG    IFEQ '0'
001761240805     C                     MOVE *BLANK    AFL1,I
001762240805X004 C                     ELSE
001763240805B005 C           TG2KFG    IFEQ '1'
001764240805     C                     MOVEL''AFL1,I
001765240805X005 C                     ELSE
001766240805     C                     MOVEL''AFL1,I
001767240805E005 C                     ENDIF
001768240805E004 C                     ENDIF
001769240805     C                     Z-ADDTG2NKN    ANKN,I           
001770240805     C*1020
001771240805     C                     MOVE TG2003    A001,I           
001772240805     C*
001773240805     C                     Z-ADDTG2010    A011,I           
001774240805     C*
001775240805     C                     MOVE TG2008    A009,I           
001776240805     C                     Z-ADD0         A008,I           
001777240805     C                     MOVE *BLANK    A002,I           
001778240805E003 C                     ENDIF
001779240805E002 C                     ENDIF
001780240805E001 C                     ENDDO
001781240805      *
001782240805     C                     ENDSR
001783240805     C******************************************
001784240805     C*
001785240805     C*
001786240805     C******************************************
001787240805     C           BANKSR    BEGSR
001788240805     C*
001789240805     C           BKKEY     KLIST
001790240805     C                     KFLD           WBKCD
001791240805     C                     KFLD           WBRCD
001792240805      *
001793240805     C           BKKEY     CHAINGNMMSP               12
001794240805     C           *IN12     IFEQ '1'
001795240805     C                     MOVE *BLANK    GNGNNM
001796240805     C                     MOVE *BLANK    GNGSNM
001797240805     C                     SETOF                     12
001798240805     C                     ELSE
001799240805     C                     ENDIF
001800240805     C                     MOVELGNGNNM    P@DAT1
001801240805     C                     MOVELGNGSNM    P@DAT2
001802240805     C                     Z-ADD24        P@LEN1  30
001803240805     C*
001804240805     C                     CALL 'SUB010'
001805240805     C                     PARM           P@DAT1100
001806240805     C                     PARM           P@DAT2100
001807240805     C                     PARM           P@DAT3100
001808240805     C                     PARM           P@LEN1  30
001809240805     C                     PARM           P@LEN2  30
001810240805     C                     PARM           P@RE1 256
001811240805     C                     PARM           P@RE2 256
001812240805     C                     PARM           P@RE3 256
001813240805     C                     PARM           P@RTC   2
001814240805     C           P@RTC     IFEQ '00'
001815240805     C                     MOVELP@RE1     BKBRNM
001816240805     C                     ELSE
001817240805     C                     MOVELP@DAT1    BKBRNM
001818240805     C                     ENDIF
001819240805     C                     ENDSR
001820240805     C******************************************
001821240805     C*
001822240805     C*
001823240805     C******************************************
001824240805     C           INIZSR    BEGSR
001825240805     C                     Z-ADD0         I       40
001826240805     C                     Z-ADD0         J       40
001827240805     C                     Z-ADD0         ZJ      40
001828240805     C*
001829240805     C                     CLEARANO
001830240805     C                     CLEARXNO
001831240805     C*
001832240805     C                     CLEARA004
001833240805     C*
001834240805     C                     CLEARA016
001835240805     C*
001836240805     C                     CLEARABKN
001837240805     C* 
001838240805     C                     CLEARAKOZ
001839240805     C*
001840240805     C*
001841240805     C                     CLEARAFL1
001842240805     C*
001843240805     C                     CLEARANKN
001844240805     C*
001845240805     C                     CLEARA011
001846240805     C*
001847240805     C                     CLEARA011
001848240805     C*
001849240805     C                     CLEARA009
001850240805     C*
001851240805     C                     CLEARA008
001852240805     C*
001853240805     C                     CLEARA002
001854240805     C*
001855240805     C                     SETOF                     515253
001856240805     C                     SETOF                     545556
001857240805     C                     SETOF                     5758
001858240805     C                     SETOF                     616263
001859240805     C                     SETOF                     646566
001860240805     C                     SETOF                     676899
001861240805     C                     ENDSR
001862240805     C******************************************
001863240805     C*
001864240805     C*
001865240805     C******************************************
001866240805     C           GSETSR    BEGSR
001867240805     C* 
001868240805     C           ZJ        IFEQ 0
001869240805     C                     Z-ADD0         J       40
001870240805     C                     ELSE
001871240805     C                     Z-ADDZJ        J       40
001872240805     C                     ENDIF
001873240805     C                     ADD  1         J
001874240805     C* OPT
001875240805     C*                    MOVE *BLANK    XOPT1
001876240805     C*
001877240805     C                     Z-ADD1         M       10
001878240805     C                     Z-ADDANO,J     XNO,M
001879240805     C*
001880240805     C                     MOVE A004,J    X0041
001881240805     C*
001882240805     C                     MOVELA016,J    X0161
001883240805     C*
001884240805     C                     MOVELABKN,J    XBKB1
001885240805     C* 
001886240805     C*                    MOVELAKOZ,J    XKOZ1
001887240805     C*
001888240805     C*
001889240805     C                     MOVELAFL1,J    XFLG1
001890240805     C*
001891240805     C                     MOVELANKN,J    XNKN1
001892240805     C*
001893240805     C                     MOVELA001,J    X0011
001894240805     C*
001895240805     C                     Z-ADDA011,J    X0111
001896240805     C*
001897240805     C                     MOVE A009,J    X0091
001898240805     C*
001899240805     C                     MOVELA008,J    X0081
001900240805     C*
001901240805     C                     MOVELA002,J    X0021
001902240805     C*
001903240805     C*8,9(2)
001904240805     C                     ADD  1         J
001905240805     C           J         IFLE I
001906240805     C                     SETON                     52
001907240805     C* OPT
001908240805     C*                    MOVE *BLANK    XOPT2
001909240805     C*
001910240805     C                     Z-ADD2         M
001911240805     C                     Z-ADDANO,J     XNO,M
001912240805     C*
001913240805     C                     MOVE A004,J    X0042
001914240805     C*
001915240805     C                     MOVELA016,J    X0162
001916240805     C*
001917240805     C                     MOVELABKN,J    XBKB2
001918240805     C* 
001919240805     C*                    MOVELAKOZ,J    XKOZ2
001920240805     C*
001921240805     C*
001922240805     C                     MOVELAFL1,J    XFLG2
001923240805     C*
001924240805     C                     MOVELANKN,J    XNKN2
001925240805     C*
001926240805     C                     MOVELA001,J    X0012
001927240805     C*
001928240805     C                     Z-ADDA011,J    X0112
001929240805     C*
001930240805     C                     MOVE A009,J    X0092
001931240805     C*
001932240805     C                     MOVELA008,J    X0082
001933240805     C*
001934240805     C                     MOVELA002,J    X0022
001935240805     C                     ENDIF
001936240805     C*10,11(3)
001937240805     C                     ADD  1         J
001938240805     C           J         IFLE I
001939240805     C                     SETON                     53
001940240805     C* OPT
001941240805     C*
001942240805     C*
001943240805     C                     Z-ADD3         M
001944240805     C                     Z-ADDANO,J     XNO,M
001945240805     C*
001946240805     C                     MOVE A004,J    X0043
001947240805     C*
001948240805     C                     MOVELA016,J    X0163
001949240805     C*
001950240805     C                     MOVELABKN,J    XBKB3
001951240805     C* 
001952240805     C*                    MOVELAKOZ,J    XKOZ3
001953240805     C*
001954240805     C*
001955240805     C                     MOVELAFL1,J    XFLG3
001956240805     C*
001957240805     C                     MOVELANKN,J    XNKN3
001958240805     C*
001959240805     C                     MOVELA001,J    X0013
001960240805     C*
001961240805     C                     Z-ADDA011,J    X0113
001962240805     C*
001963240805     C                     MOVE A009,J    X0093
001964240805     C*
001965240805     C                     MOVELA008,J    X0083
001966240805     C*
001967240805     C                     MOVELA002,J    X0023
001968240805     C                     ENDIF
001969240805     C*12,13(4)
001970240805     C                     ADD  1         J
001971240805     C           J         IFLE I
001972240805     C                     SETON                     54
001973240805     C* OPT
001974240805     C*                    MOVE *BLANK    XOPT4
001975240805     C*
001976240805     C                     Z-ADD4         M
001977240805     C                     Z-ADDANO,J     XNO,M
001978240805     C*
001979240805     C                     MOVE A004,J    X0044
001980240805     C*
001981240805     C                     MOVELA016,J    X0164
001982240805     C*
001983240805     C                     MOVELABKN,J    XBKB4
001984240805     C* 
001985240805     C*                    MOVELAKOZ,J    XKOZ4
001986240805     C*
001987240805     C*
001988240805     C                     MOVELAFL1,J    XFLG4
001989240805     C*
001990240805     C                     MOVELANKN,J    XNKN4
001991240805     C*
001992240805     C                     MOVELA001,J    X0014
001993240805     C*
001994240805     C                     Z-ADDA011,J    X0114
001995240805     C*
001996240805     C                     MOVE A009,J    X0094
001997240805     C*
001998240805     C                     MOVELA008,J    X0084
001999240805     C*
002000240805     C                     MOVELA002,J    X0024
002001240805     C                     ENDIF
002002240805     C*14,15(5)
002003240805     C                     ADD  1         J
002004240805     C           J         IFLE I
002005240805     C                     SETON                     55
002006240805     C* OPT
002007240805     C*                    MOVE *BLANK    XOPT5
002008240805     C*
002009240805     C                     Z-ADD5         M
002010240805     C                     Z-ADDANO,J     XNO,M
002011240805     C*
002012240805     C                     MOVE A004,J    X0045
002013240805     C*
002014240805     C                     MOVELA016,J    X0165
002015240805     C*
002016240805     C                     MOVELABKN,J    XBKB5
002017240805     C* 
002018240805     C*                    MOVELAKOZ,J    XKOZ5
002019240805     C*
002020240805     C*
002021240805     C                     MOVELAFL1,J    XFLG5
002022240805     C*
002023240805     C                     MOVELANKN,J    XNKN5
002024240805     C*
002025240805     C                     MOVELA001,J    X0015
002026240805     C*
002027240805     C                     Z-ADDA011,J    X0115
002028240805     C*
002029240805     C                     MOVE A009,J    X0095
002030240805     C*
002031240805     C                     MOVELA008,J    X0085
002032240805     C*
002033240805     C                     MOVELA002,J    X0025
002034240805     C                     ENDIF
002035240805     C*16,17(6)
002036240805     C                     ADD  1         J
002037240805     C           J         IFLE I
002038240805     C                     SETON                     56
002039240805     C* OPT
002040240805     C*                    MOVE *BLANK    XOPT6
002041240805     C*
002042240805     C                     Z-ADD6         M
002043240805     C                     Z-ADDANO,J     XNO,M
002044240805     C*
002045240805     C                     MOVE A004,J    X0046
002046240805     C*
002047240805     C                     MOVELA016,J    X0166
002048240805     C*
002049240805     C                     MOVELABKN,J    XBKB6
002050240805     C* 
002051240805     C*                    MOVELAKOZ,J    XKOZ6
002052240805     C*
002053240805     C*
002054240805     C                     MOVELAFL1,J    XFLG6
002055240805     C*
002056240805     C                     MOVELANKN,J    XNKN6
002057240805     C*
002058240805     C                     MOVELA001,J    X0016
002059240805     C*
002060240805     C                     Z-ADDA011,J    X0116
002061240805     C*
002062240805     C                     MOVE A009,J    X0096
002063240805     C*
002064240805     C                     MOVELA008,J    X0086
002065240805     C*
002066240805     C                     MOVELA002,J    X0026
002067240805     C                     ENDIF
002068240805     C*18,19(7)
002069240805     C                     ADD  1         J
002070240805     C           J         IFLE I
002071240805     C                     SETON                     57
002072240805     C* OPT
002073240805     C*                    MOVE *BLANK    XOPT7
002074240805     C*
002075240805     C                     Z-ADD7         M
002076240805     C                     Z-ADDANO,J     XNO,M
002077240805     C*
002078240805     C                     MOVE A004,J    X0047
002079240805     C*
002080240805     C                     MOVELA016,J    X0167
002081240805     C*
002082240805     C                     MOVELABKN,J    XBKB7
002083240805     C* 
002084240805     C*                    MOVELAKOZ,J    XKOZ7
002085240805     C*
002086240805     C*
002087240805     C                     MOVELAFL1,J    XFLG7
002088240805     C*
002089240805     C                     MOVELANKN,J    XNKN7
002090240805     C*
002091240805     C                     MOVELA001,J    X0017
002092240805     C*
002093240805     C                     Z-ADDA011,J    X0117
002094240805     C*
002095240805     C                     MOVE A009,J    X0097
002096240805     C*
002097240805     C                     MOVELA008,J    X0087
002098240805     C*
002099240805     C                     MOVELA002,J    X0027
002100240805     C                     ENDIF
002101240805     C*20,21(8)
002102240805     C                     ADD  1         J
002103240805     C           J         IFLE I
002104240805     C                     SETON                     58
002105240805     C* OPT
002106240805     C*                    MOVE *BLANK    XOPT8
002107240805     C*
002108240805     C                     Z-ADD8         M
002109240805     C                     Z-ADDANO,J     XNO,M
002110240805     C*
002111240805     C                     MOVE A004,J    X0048
002112240805     C*
002113240805     C                     MOVELA016,J    X0168
002114240805     C*
002115240805     C                     MOVELABKN,J    XBKB8
002116240805     C* 
002117240805     C*                    MOVELAKOZ,J    XKOZ8
002118240805     C*
002119240805     C*
002120240805     C                     MOVELAFL1,J    XFLG8
002121240805     C*
002122240805     C                     MOVELANKN,J    XNKN8
002123240805     C*
002124240805     C                     MOVELA001,J    X0018
002125240805     C*
002126240805     C                     Z-ADDA011,J    X0118
002127240805     C*
002128240805     C                     MOVE A009,J    X0098
002129240805     C*
002130240805     C                     MOVELA008,J    X0088
002131240805     C*
002132240805     C                     MOVELA002,J    X0028
002133240805     C                     ENDIF
002134240805     C           I         IFGT J
002135240805     C                     SETON                     71
002136240805     C                     ELSE
002137240805     C                     SETOF                     71
002138240805     C                     ENDIF
002139240805     C           J         IFGT 8
002140240805     C                     SETON                     70
002141240805     C                     ELSE
002142240805     C                     SETOF                     70
002143240805     C                     ENDIF
002144240805     C                     Z-ADDJ         ZJ
002145240805     C                     ENDSR
002146240805     C******************************************
002147240805     C*
002148240805     C*
002149240805     C******************************************
002150240805     C           GCHECK    BEGSR
002151240805     C                     Z-ADD0         GN      10
002152240805     C*1
002153240805     C                     Z-ADD1         N       10
002154240805     C           ZJ        ADD  1         K       40
002155240805B001 C           XOPT1     IFEQ '1'
002156240805     C*
002157240805     C                     EXSR CALLSR
002158240805X001 C                     ELSE
002159240805B002 C           XOPT1     IFEQ 'D'
002160240805     C*
002161240805     C                     EXSR DELSR
002162240805B002 C                     ENDIF
002163240805B001 C                     ENDIF
002164240805     C                     MOVE *BLANK    XOPT1
002165240805     C*---------------------------------------------------
002166240805     C*2
002167240805     C           ZJ        ADD  2         K
002168240805     C                     Z-ADD2         N
002169240805B001 C           K         IFLE J
002170240805B002 C           XOPT2     IFEQ '1'
002171240805     C*
002172240805     C                     EXSR CALLSR
002173240805X002 C                     ELSE
002174240805B003 C           XOPT3     IFEQ 'D'
002175240805     C*
002176240805     C                     EXSR DELSR
002177240805B003 C                     ENDIF
002178240805B002 C                     ENDIF
002179240805B001 C                     ENDIF
002180240805     C                     MOVE *BLANK    XOPT2
002181240805     C*---------------------------------------------------
002182240805     C*3
002183240805     C                     Z-ADD3         N       10
002184240805     C           ZJ        ADD  3         K       40
002185240805B001 C           K         IFLE J
002186240805B002 C           XOPT3     IFEQ '1'
002187240805     C*
002188240805     C                     EXSR CALLSR
002189240805X002 C                     ELSE
002190240805B003 C           XOPT3     IFEQ 'D'
002191240805     C*
002192240805     C                     EXSR DELSR
002193240805B003 C                     ENDIF
002194240805B002 C                     ENDIF
002195240805B001 C                     ENDIF
002196240805     C                     MOVE *BLANK    XOPT3
002197240805     C*---------------------------------------------------
002198240805     C*4
002199240805     C                     Z-ADD4         N       10
002200240805     C           ZJ        ADD  4         K       40
002201240805B001 C           K         IFLE J
002202240805B002 C           XOPT4     IFEQ '1'
002203240805     C*
002204240805     C                     EXSR CALLSR
002205240805X002 C                     ELSE
002206240805B003 C           XOPT4     IFEQ 'D'
002207240805     C*
002208240805     C                     EXSR DELSR
002209240805B003 C                     ENDIF
002210240805B002 C                     ENDIF
002211240805B001 C                     ENDIF
002212240805     C                     MOVE *BLANK    XOPT4
002213240805     C*---------------------------------------------------
002214240805     C*5
002215240805     C                     Z-ADD5         N       10
002216240805     C           ZJ        ADD  5         K       40
002217240805B001 C           K         IFLE J
002218240805B002 C           XOPT5     IFEQ '1'
002219240805     C*
002220240805     C                     EXSR CALLSR
002221240805X002 C                     ELSE
002222240805B003 C           XOPT5     IFEQ 'D'
002223240805     C*
002224240805     C                     EXSR DELSR
002225240805B003 C                     ENDIF
002226240805B002 C                     ENDIF
002227240805B001 C                     ENDIF
002228240805     C                     MOVE *BLANK    XOPT5
002229240805     C*---------------------------------------------------
002230240805     C*6
002231240805     C                     Z-ADD6         N       10
002232240805     C           ZJ        ADD  6         K       40
002233240805B001 C           K         IFLE J
002234240805B002 C           XOPT6     IFEQ '1'
002235240805     C*
002236240805     C                     EXSR CALLSR
002237240805X002 C                     ELSE
002238240805B003 C           XOPT6     IFEQ 'D'
002239240805     C*
002240240805     C                     EXSR DELSR
002241240805B003 C                     ENDIF
002242240805B002 C                     ENDIF
002243240805B001 C                     ENDIF
002244240805     C                     MOVE *BLANK    XOPT6
002245240805     C*---------------------------------------------------
002246240805     C*7
002247240805     C                     Z-ADD7         N       10
002248240805     C           ZJ        ADD  7         K       40
002249240805B001 C           K         IFLE J
002250240805B002 C           XOPT7     IFEQ '1'
002251240805     C*
002252240805     C                     EXSR CALLSR
002253240805X002 C                     ELSE
002254240805B003 C           XOPT7     IFEQ 'D'
002255240805     C*
002256240805     C                     EXSR DELSR
002257240805B003 C                     ENDIF
002258240805B002 C                     ENDIF
002259240805B001 C                     ENDIF
002260240805     C                     MOVE *BLANK    XOPT7
002261240805     C*---------------------------------------------------
002262240805     C*8
002263240805     C                     Z-ADD8         N       10
002264240805     C           ZJ        ADD  8         K       40
002265240805B001 C           K         IFLE J
002266240805B002 C           XOPT8     IFEQ '1'
002267240805     C*
002268240805     C                     EXSR CALLSR
002269240805X002 C                     ELSE
002270240805B003 C           XOPT8     IFEQ 'D'
002271240805     C*
002272240805     C                     EXSR DELSR
002273240805B003 C                     ENDIF
002274240805B002 C                     ENDIF
002275240805B001 C                     ENDIF
002276240805     C                     MOVE *BLANK    XOPT8
002277240805     C*---------------------------------------------------
002278240805     C                     ENDSR
002279240805     C******************************************
002280240805     C*
002281240805     C*
002282240805     C******************************************
002283240805     C           DELSR     BEGSR
002284240805     C*
002285240805     C                     Z-ADDXNO,N     WNO     60
002286240805B001 C           PKUBUN    IFEQ '1'
002287240805     C           PKUBUN    OREQ '2'
002288240805     C           WNO       CHAINTG1FLL01             91
002289240805B002 C           *IN91     IFEQ '1'
002290240805     C                     SETOF                     91
002291240805X002 C                     ELSE
002292240805     C                     MOVEL'D'       TG1DFG           
002293240805     C           WDATE     ADD  20000000  TG1UPD           
002294240805     C                     Z-ADDWTIME     TG1UPT           
002295240805     C                     MOVELXWSID2    TG1UPW           ID
002296240805     C                     UPDATTG1FLR1
002297240805E002 C                     ENDIF
002298240805X001 C                     ELSE
002299240805B002 C           PKUBUN    IFEQ '3'
002300240805     C           WNO       CHAINTG2FLL01             91
002301240805B003 C           *IN91     IFEQ '1'
002302240805     C                     SETOF                     91
002303240805X003 C                     ELSE
002304240805     C                     MOVEL'D'       TG2DFG           
002305240805     C           WDATE     ADD  20000000  TG2UPD           
002306240805     C                     Z-ADDWTIME     TG2UPT           
002307240805     C                     MOVELXWSID2    TG2UPW           ID
002308240805     C                     UPDATTG2FLR1
002309240805E003 C                     ENDIF
002310240805E002 C                     ENDIF
002311240805E001 C                     ENDIF
002312240805     C                     ENDSR
002313240805     C******************************************
002314240805     C*
002315240805     C*
002316240805     C******************************************
002317240805     C           DATASR    BEGSR
002318240805     C*
002319240805B001 C           PKUBUN    IFEQ '1'
002320240805     C*
002321240805     C                     EXSR SET1
002322240805X001 C                     ELSE
002323240805B002 C           PKUBUN    IFEQ '2'
002324240805     C*
002325240805     C                     EXSR SET2
002333240805X002 C                     ELSE
002334240805     C*
002335240805B003 C           PKUBUN    IFEQ '3'
002336240805     C                     EXSR SET3
002337240805E003 C                     ENDIF
002338240805E002 C                     ENDIF
002339240805E001 C                     ENDIF
002340240805     C                     ENDSR
002341240805     C******************************************
002342240805     C**  24/06/07 NOS.NISHIGAKI *******
002343240805** TABKBN/TABNAM 
0023442408051
0023452408052
0023462408053
