000100240731     H*****************************************************************
000200240729     H*                                           CREATE; 00/00/00    *
000300240729     H*    PGM-NAME;                                                  *
000400000000     H*                                           CHANGE; XX/XX/XX    *
000500240729     H*    CONTENTS;                            *
000600240729     H*                                           WRITER; *
000700000000     H*****************************************************************
000800240802     H*¶À¶Å  AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
000900240730     H*RDI5250
001000240802     H* 8/2
001100240805     H* 8/28/5
001200240802     C                     MOVE ' '       MOZI1   5      51
001300240802     C                     MOVE ' '       MOZI2   5      52
001400240802     C                     MOVEL'AAAAA'   MOZI1   5
001500240802     C                     MOVEL''  MOZI2   5
001600240802     C                     DSPLY          MOZI1
001700240802     C                     DSPLY          MOZI2
001800240806     C*                    DSPLY          MOZI3
001900240729     C                     SETON                     LR
002000240729     C                     RETRN
