000100240731     H*****************************************************************
000200240729     H*                                           CREATE; 00/00/00    *
000300240729     H*    PGM-NAME;                                                  *
000400000000     H*                                           CHANGE; XX/XX/XX    *
000500240729     H*    CONTENTS;                            *
000600240729     H*                                           WRITER; *
000700000000     H*****************************************************************
000800240730     H*¶À¶Å 
000900240730     H*RDI5250
001000240801     C                     Z-ADD0         RESULT  20 50
001001240802     C                     MOVE ' '       MOZI1   5      51
001002240802     C                     MOVE ' '       MOZI2   5      52
001100240730     C           RESULT    IFEQ 0
001200240802     C                     DO   3
001300240729     C                     ADD  1         RESULT
001400240730     C                     ENDDO
001401240809     C                     MOVEL''  MOZI1
001403240809     C                     MOVEL'AAAAA'   MOZI2
001500240730     C           RESULT    IFNE 3
001600240730     C                     DO   4
001700240729     C                     ADD  1         RESULT
001800240730     C                     ENDDO
001900240729     C                     DSPLY          RESULT
001901240802     C                     DSPLY          MOZI1
001902240802     C                     DSPLY          MOZI2
002000240802     C                     ENDIF
002100240802     C                     ENDIF
002107240809
002114240809
002115240809
002116240809
002117240809
002118240809
002119240809
002120240809
002121240809
002122240809
002200240729     C                     SETON                     LR
002300240729     C                     RETRN
