000100240808     H****************************************************************
000200240808     H*    CONTENTS;                     *
000300240808     H*                                          CREATE; XX/XX/XX   *
000400240808     H*                                          CHANGE; 00/00/00    *
000500240808     H*                                          WRITER; N.NISHIGAKI *
000600240808     H****************************************************************
000700240808     H*XX/XX/XX N.NISHIGAKI
000800240808     H****************************************************************
000900240808     H             Y                                    1
001000240808     F*
001100240808     FNKNFLL13IF  E           K        DISK
001200240808     F            NKNFLR                            KRENAMENKNFLR13
001300240808     F*
001400240808     FNKNFLPZ O   E           K        DISK
001500240808     I*****************************************************************
001600240808     I*                                                     *
001700240808     I*****************************************************************
001800240808     I            DS
001900240808     I                                        1   60WUYMD
002000240808     I                                        1   20WUYY
002100240808     I                                        3   40WUMM
002200240808     I                                        5   60WUDD
002300240808     C*****************************************************************
002400240808     C*                    MAINROUTINE                                *
002500240808     C*****************************************************************
002600240808     C*
002700240808     C                     EXSR @INT
002800240808     C                     CLEARNKNFLZ
002900240808     C*
003000240808     C                     Z-ADDUDATE     DATE    60
003100240808     C           DATE      SETLLNKNFLL13
003200240808     C           *IN20     DOWEQ'0'
003300240808     C           DATE      READENKNFLL13                 20
003400240808     C           *IN20     IFEQ '0'
003500240808   #@C        N20          EXSR S#@C01
003600240808     C                     WRITENKNFLZ
003700240808     C                     END
003800240808     C                     ENDDO
003900240808     C*
004000240808     C*
004100240808     C                     SETON                     LR
004200240808     C                     RETRN
004300240808     C*****************************************************************
004400240808     C*          @INT      SUBROUTINE                                 *
004500240808     C*****************************************************************
004600240808     C           @INT      BEGSR
004700240808     C*
004800240808     C                     MOVEL*ALL'0'   *IN               FLG CLEAR
004900240808     C                     MOVE *BLANK    NKJTCD           º°ÄÞ
005000240808     C                     Z-ADD*ZERO     NKNKNO           
005100240808     C                     Z-ADD*ZERO     NKNKDT           
005200240808     C                     MOVE *BLANK    NKSRKB            
005300240808     C                     MOVE *BLANK    NKTOCD           º°ÄÞ
005400240808     C                     MOVE *BLANK    NKSTCD           º°ÄÞ
005500240808     C                     Z-ADD*ZERO     NKNKKG           
005600240808     C                     MOVE *BLANK    NKTEKI           
005700240808     C                     Z-ADD*ZERO     NKKSDT           
005800240808     C                     Z-ADD*ZERO     NKSAIT           
005900240808     C                     MOVE *BLANK    NKTGNO           
006000240808     C                     MOVE *BLANK    NKTGKB            
006100240808     C                     MOVE *BLANK    NKFLG1            Ì×¸Þ1
006200240808     C                     MOVE *BLANK    NKFLG2            Ì×¸Þ2
006300240808     C                     MOVE *BLANK    NKFLG3            Ì×¸Þ3
006400240808     C                     Z-ADD*ZERO     NKETK1           1
006500240808     C                     Z-ADD*ZERO     NKETK2           2
006600240808     C                     Z-ADD*ZERO     NKETK3           3
006700240808     C                     MOVE *BLANK    NKINWS           ID
006800240808     C                     Z-ADD*ZERO     NKINDT           
006900240808     C                     Z-ADD*ZERO     NKINTM           
007000240808     C                     MOVE *BLANK    NKUPWS           ID
007100240808     C                     Z-ADD*ZERO     NKUPDT           
007200240808     C                     Z-ADD*ZERO     NKUPTM           
007300240808     C                     MOVE *BLANK    NKUPPG           ÌßÛ¸Þ×Ñ
007400240808     C                     Z-ADD*ZERO     NKIND@           
007500240808     C                     Z-ADD*ZERO     NKKSD@           
007600240808     C                     Z-ADD*ZERO     NKNKD@           
007700240808     C                     Z-ADD*ZERO     NKUPD@           
007800240808     C                     MOVE *BLANK    #@067\           Ì×¸Þ
007900240808     C*
008000240808     C                     ENDSR
008100240808   #@C*==============================================================*
008200240808   #@C*          S#@C01   
008300240808   #@C*==============================================================*
008400240808   #@C           S#@C01    BEGSR
008500240808   #@C*
008600240808   #@C                     MOVE NKIND@    NKINDT
008700240808   #@C                     MOVE NKKSD@    NKKSDT
008800240808   #@C                     MOVE NKNKD@    NKNKDT
008900240808   #@C                     MOVE NKUPD@    NKUPDT
009000240808   #@C                     MOVE NKIND@    NKIND@  80
009100240808   #@C                     MOVE NKKSD@    NKKSD@  80
009200240808   #@C                     MOVE NKNKD@    NKNKD@  80
009300240808   #@C                     MOVE NKUPD@    NKUPD@  80
009400240808   #@C*
009500240808   #@C                     ENDSR
009600240808   #@C*==============================================================*
