000100240215     A*****************************************************************
000200240612     A*    **  **             *
000300240612     A*                                         CREATE  :  24/06/12   *
000400240215     A*                                         UPDAT   :    /  /     *
000500240612     A*                                         NOS.NISHIGAKI         *
000600240613     A*     PROG-ID : TD3578FM                  CAHNGE  :    /  /     *
000700240215     A*                                                               *
000800240215     A*****************************************************************
000900240219     A                                      DSPSIZ(24 80 *DS3)
001000240219     A                                      PRINT
001100240614     A          R TD3578R1                  OVERLAY PROTECT BLINK
001200240215     A                                      ERASE(SFLCTL SFLREC)
001300240215     A                                      CF01(01 '')
001400240613     A                                  1  2'TD3578'
001500240613     A                                  1 25''
001600240215     A                                      DSPATR(HI RI)
001700240215     A                                  1 56DATE EDTCDE(9)
001800240215     A                                  1 66TIME
001900240215     A            XWSID          4      1 76
002000240613     A                                  2 25''
002100240215     A                                      DSPATR(HI RI)
002200240522     A                                      COLOR(BLU)
002300240612     A                                  4  3'OPT: 1='
002400240215     A******
002500240215     A          R SFLREC                    SFL
002600240215     A            XOPT           1   B  7  4DSPATR(CS)
002700240215     A  81                                  DSPATR(RI PC)
002800240216     A            XNB01          9      7  6TEXT('')
002900240216     A            XNB02          4      7 19TEXT('')
003000240216     A            XNB04          3      7 25TEXT('')
003100240612     A            XNB07          7      7 32TEXT('')
003200240613     A            XNB08         10  0   7 41TEXT('')
003300240216     A                                      EDTCDE(4)
003400240612     A            XGNNM         16      8 19TEXT('')
003500240612     A            XGSNM         16      8 36TEXT('')
003600240215     A*
003700240617     A            RRNO2          3  0H      TEXT('')
003800240216     A*
003900240215     A          R SFLCTL                    SFLCTL(SFLREC)
004000240215     A                                      CF01(01 '')
004100240215     A                                      CF04(04 '')
004200240219     A                                      SFLPAG(0007)
004300240219     A                                      SFLSIZ(0008)
004400240215     A                                      OVERLAY PROTECT BLINK
004500240216     A  51                                  SFLDSPCTL
004600240216     A  52                                  SFLDSP
004700240216     A  53                                  SFLCLR
004800240216     A  54                                  SFLEND(*MORE)
004900240216     A            DFRCDN         4  0H      SFLRCDNBR
005000240612     A*                                 5  3'OPT+
005100240612     A*                                      '
005200240612     A*                                 5 46''
005300240612     A                                  5  3'OPT+
005400240612     A                                        '
005500240612     A                                  5 42''
005600240613     A*                                 5 53''
005700240215     A*
005800240613     A          R TD3578R9                  OVERLAY
005900240215     A*                                                                ----+
006000240219     A                                 23  2'CMD1:'
006100240215     A                                      COLOR(BLU)
006200240613     A                                 23 14'CMD4:'
006300240215     A                                      COLOR(BLU)
006400240215     A*
