000100240104/********************************************************************/
000200240305/**                                         CREATE  :  24/03/05    **/
000300240305/**                                  **/
000400240104/**                                         CHANGE  :  XX/XX/XX    **/
000500240305/**    PROG-ID : TD3572C                                           **/
000600240221/**                                         WRITER  :  S.NOS       **/
000601240612/**24/06/12 NOS KAMATA                   **/
000700240104/********************************************************************/
000800231227
000900240612 PGM        PARM(&KTYM &SHDT &SRCD &SYKS &RTCD)
001000240221
001100240305             DCL        VAR(&KTYM) TYPE(*DEC)  LEN(6 0)  /**/
001101240612             DCL        VAR(&SHDT) TYPE(*DEC)  LEN(8 0)  /**/
001200240305             DCL        VAR(&SRCD) TYPE(*CHAR) LEN(1)    /**/
001300240305             DCL        VAR(&SYKS) TYPE(*DEC)  LEN(4 0)  /**/
001400240305             DCL        VAR(&RTCD) TYPE(*CHAR) LEN(2)    /* ØÀ°Ýº°ÄÞ */
001500240305             DCL        VAR(&PCMD) TYPE(*CHAR) LEN(80)   /*ÊÞ¯ÁºÏÝÄÞ */
001600231225
001700240222/* ØÀ°Ýº°ÄÞ */
001800240222             CHGVAR     VAR(&RTCD) VALUE('00')
001900240305
002000240424/*----------------------------*/
002100240424/*    */
002200240424/*----------------------------*/
002300240424/**/
002400240424/*----------------------------*/
002500240305             IF  COND(&SRCD *EQ '1') THEN(DO)
002600240305             CHGVAR     VAR(&PCMD)   VALUE('"C:\NB\RISONA.BAT"')
002700240322/**/
002800240322             CLRPFM     FILE(NBSHAP)
002900240322/**/
003000240613             CALL       PGM(TD3574) PARM(&KTYM &SHDT &SRCD &SYKS &RTCD)
003100240322/**/
003200240610/* ACS     */
003300240612        /*   STRPCCMD   PCCMD('RTOPCB.EXE +
003400240610                              "C:\SAVEF\.DTFX"') +
003500240612                        PAUSE(*NO)      */
003600240424/* CA                 */
003700240424      /*     STRPCO                                   */
003800240424      /*     MONMSG     MSGID(CPF0000 IWS4010)        */
003900240424      /*                                              */
004000240322      /*     STRPCCMD   PCCMD('PCSFT5.EXE +           */
004100240322      /*                      "C:\NB\RISONA.TTO"') +  */
004200240424      /*                       PAUSE(*NO)             */
004300240322
004400240424/* BAT                */
004500240610/*           STRPCCMD   PCCMD(&PCMD) +        */
004600240610/*                      PAUSE(*NO)            */
004700240612             ENDDO
004800240322
004900240424/*----------------------------*/
005000240424/**/
005100240424/*----------------------------*/
005200240424/*      */
005300240424/*----------------------------*/
005400240305             IF  COND(&SRCD *EQ '2') THEN(DO)
005500240322             CHGVAR     VAR(&PCMD)   VALUE('"C:\NB\MITUBISI.BAT"')
005600240312/**/
005700240315             CLRPFM     FILE(NBSHHP)       /**/
005800240315             CLRPFM     FILE(NBSHDP)       /**/
005900240315             CLRPFM     FILE(NBSHTP)       /**/
006000240315             CLRPFM     FILE(NBSHEP)       /**/
006100240322/**/
006200240613             CALL       PGM(TD3576) PARM(&KTYM &SHDT &SRCD &SYKS &RTCD)
006300240305/**/
006400240424/* CA                 */
006500240424      /*     STRPCO                                    */
006600240424      /*     MONMSG     MSGID(CPF0000 IWS4010)         */
006700240424      /*                                               */
006800240424      /*     STRPCCMD   PCCMD('PCSFT5.EXE +            */
006900240424      /*                      "C:\NB\MITUBISI.TTO"') + */
007000240424      /*                          PAUSE(*NO)           */
007100240322
007200240424/* BAT                 */
007300240610/*           STRPCCMD   PCCMD(&PCMD) +    */
007400240610/*                      PAUSE(*NO)        */
007500240612             ENDDO
007600231228
007700240104EXIT:
007800920122             ENDPGM
