000100150916    ? *===============================================================*
000200240613      *   PROGRAM      :                            *
000300240612      *   PROGRAM    :  *
000400150916    ? *===============================================================*
000500240612      *   CREATION DATE    :  2024/06/12                              *
000600240612      *   PROGRAMER NAME   :  NOS.NISHIGAKI                           *
000700150916    ? *===============================================================*
000800150916      *   CHANGE HISTORY   :  ____/__/__                              *
000900150916      *                    :  _._________ (_____)                     *
001000150916      *                    :  *
001100150916    ? *===============================================================*
001200090606      *--------------------------------------------------------------*
001300090606      *   SW        ON/OFF   COMMENT                                 *
001400090606      *                                                              *
001500090606      *   51                 SFLDSPCTL                               *
001600090606      *   52                 SFLDSP                                  *
001700090606      *   53                 SFLCLR                                  *
001800150917      *   61                 READ                                    *
001900090606      *   65                 CHAIN                                   *
002000090606      *                                                              *
002100090606      *--------------------------------------------------------------*
002200150916    ? *===============================================================*
002300090606     H            Y/                                    1
002400150916    ? *===============================================================*
002500150917      *<<>>
002600240613     FTD3578FMCF  E                    WORKSTN
002700240216     F                                        RRN1  KSFILE SFLREC
002800090725     F                                              KINFDS \INFDS
002900240612     F*<<>>
003000240612     FNBSHAP  IF  E                    DISK
003100240614     F                                              KRECNO RRNO1
003200150916    ? *===============================================================*
003300150917      *   ¥ D#PGLN
003400090725     I\INFDS      DS
003500240216     I                                      273 276 XWSID
003600240216     I                                    B 370 3710D#LNCO
003700150917     I                                    B 378 3790D#PGLN
003800150917    ? *=======================================================*
003900150917      *                      
004000150917    ? *=======================================================*
004100150917      *
004200150917      *   ¥ D#PGIDPROGRAM ID.
004300150917      *   ¥ D#JOB JOB ID.
004400150917      *   ¥ D#USERUSER ID.
004500150917      *   ¥ D#TIME
004600150917      *           
004700150917     I           SDS
004800150917     I                                        1  10 D#PGID
004900150917     I                                      244 253 D#JOB
005000150917     I                                      254 263 D#USER
005100150917     I                                      282 2870D#TIME
005200240612     I*
005300240612     I*
005400240612     I            DS
005500240612     I                                        1 250 NBS001
005600240612     I                                        1   10WDTKBN
005700240612     I*
005800240612     I                                        2  10 WDTRIY
005900240612     I                                       11  140WDTRBK
006000240612     I                                       15  29 WDTRBN
006100240612     I                                       30  320WDTRST
006200240612     I                                       33  47 WDTRSN
006300240612     I                                       48  480WDYKSH
006400240612     I                                       49  550WDKOUZ
006500240612     I                                       56  650WDSIKG
006600240612     I                                       66  730WDKIJT
006700240612     I                                       74  740WDJYOT
006800240612     I                                       75  94 WDKIRK
006900240612     I                                       95  95 WDHSZF
007000240612     I                                       96 135 WDREFN
007100240612     I                                      136 250 WDYOBI
007200150917    ? *=======================================================*
007300150917      *                                         *
007400150917    ? *=======================================================*
007500150916    ? *---------------------------------------------------------------*
007600090606      *
007700150916    ? *---------------------------------------------------------------*
007800240613      *<<>>
007900240613     C           P#3578    PLIST
008000240216     C*            
008100240612     C                     PARM           PRRN1   30       
008200150916    ? *---------------------------------------------------------------*
008300090606      *
008400150916    ? *---------------------------------------------------------------*
008500150916    ? *---------------------------------------------------------------*
008600090606      *
008700150916    ? *---------------------------------------------------------------*
008800240613     C           #INT      TAG
008900240613     C                     Z-ADD*ZERO     C#CSRY 020       
009000240613     C                     Z-ADD*ZERO     C#CSRX 030       
009100240613     C                     Z-ADD*ZERO     C#RECN  40        
009200240613     C                     Z-ADD*ZERO     C#PGLN  50        SFLRRN
009300240613     C                     Z-ADD*ZERO     RRN1    40
009400240613     C                     MOVEL'1'       W\DSP   1
009500240614     C                     Z-ADD*ZERO     RRNO1   30
009600150917      *
009700090606      *--------------------------------------------------------------*
009800150917      *
009900090606      *--------------------------------------------------------------*
010000090606      *<<>>
010100090606     C                     DO   *HIVAL
010200240613     C           *IN15     IFEQ '1'
010300240613     C                     Z-ADD*ZERO     C#CSRY 020       
010400240613     C                     Z-ADD*ZERO     C#CSRX 030       
010500240613     C                     Z-ADD*ZERO     C#RECN  40        
010600240613     C                     Z-ADD*ZERO     C#PGLN  50        SFLRRN
010700240613     C                     Z-ADD*ZERO     RRN1    40
010800240613     C                     Z-ADD*ZERO     DFRCDN
010900240613     C                     MOVEL'1'       W\DSP   1
011000240613     C                     SETOF                     90  15
011100240613     C                     CLEARSFLCTL
011200240613     C                     ENDIF
011300090606     C           W\DSP     CASEQ'1'       #DSP1            
011400090606     C           W\DSP     CASEQ'9'       #END             
011500090606     C                     ENDCS
011600090606     C                     ENDDO
011700090606      *--------------------------------------------------------------*
011800090606      *
011900090606      *--------------------------------------------------------------*
012000090606     C           #DSP1     BEGSR
012100150916      *
012200150916      *
012300240216     C                     EXSR #SET01
012400090606      *
012500150917     C                     DO   *HIVAL                     S1
012600090606      *
012700090606     C                     SETON                     51
012800240613     C                     WRITETD3578R1
012900240613     C                     WRITETD3578R9
013000150917     C                     Z-ADDC#PGLN    DFRCDN
013100240216     C                     EXFMTSFLCTL
013200150917     C                     Z-ADDD#PGLN    C#PGLN
013300240216     C                     SETOF                     519981
013400150917     C                     Z-ADDD#PGLN    DFRCDN
013500240216      * F1=
013600240216     C           *IN01     IFEQ '1'                        S2
013700150916     C                     MOVEL'9'       W\DSP
013800150917     C                     LEAVE                           
013900150917     C                     ENDIF                           E2
014000150917      *
014100240216     C                     EXSR #CHK01
014200150917     C           *IN99     IFEQ '0'                        S2
014300240216     C           *IN04     ANDEQ'1'                        S2
014400240216     C                     EXSR #CALL1                     
014500240613     C                     SETOF                     90  01
014600240613     C                     SETON                         15
014700240613     C                     GOTO #INT
014800240216     C                     LEAVE
014900150917     C                     ENDIF                           E2
015000090606      *
015100150917     C                     ENDDO                           E1
015200090606      *
015300090606     C                     ENDSR
015400150916      *--------------------------------------------------------------*
015500150917      *
015600150916      *--------------------------------------------------------------*
015700240216     C           #SET01    BEGSR
015800150916      *
015900150916     C                     SETON                     53
016000240216     C                     WRITESFLCTL
016100150916     C                     SETOF                     5352
016200150917     C                     Z-ADD*ZERO     RRN1
016300150917     C                     Z-ADD1         DFRCDN
016400150917      *
016500150917     C                     Z-ADD0         C#PGLN
016600150917     C                     Z-ADD0         C#RECN
016700150917     C                     SETOF                     30
016800150917      *
016900240612     C*
017000240613     C           1         SETLLNBSHAR
017100240216     C           *IN90     DOUEQ'1'
017200240612     C                     READ NBSHAR                   90
017300240612     C           WDTKBN    IFEQ 2
017400240216     C           *IN90     IFEQ '0'
017500160316      *
017600160316      *     999
017700240216     C           RRN1      IFLE 999
017800240612     C*
017900240216     C                     EXSR #SFNBN
018000240216     C                     ADD  1         RRN1
018100150917     C                     SETON                     54
018200240216     C                     WRITESFLREC
018300150917     C  N52                SETON                     52
018400150917     C                     Z-ADDRRN1      C#RECN           
018500150917     C                     Z-ADDRRN1      C#PGLN
018600150917     C                     SETON                     30
018700151124      *
018800240216     C                     ENDIF                           E2
018900240216      *
019000240216     C                     ENDIF                           E2
019100150917      *
019200240612     C                     ENDIF                           E3
019300240612      *
019400150917     C                     ENDDO                           E1
019500150917      *
019600150917     C                     Z-ADD001       C#PGLN
019700150916      *
019800150916     C                     ENDSR
019900160315      *--------------------------------------------------------------*
020000240613      *
020100160315      *--------------------------------------------------------------*
020200240216     C           #SFNBN    BEGSR
020300240216     C*
020400240216     C                     MOVE *BLANK    XOPT             OPT
020500240612     C                     MOVELWDTRIY    XNB01            
020600240612     C                     MOVELWDTRBK    XNB02            
020700240612     C                     MOVE WDTRST    XNB04            
020800240612     C*                    MOVELWDYKSH    XNB06            
020900240612     C                     MOVELWDKOUZ    XNB07            
021000240612     C                     Z-ADDWDSIKG    XNB08            
021100240614     C                     Z-ADDRRNO1     RRNO2            
021200160315     C                     ENDSR
021300150917      *--------------------------------------------------------------*
021400150917      *
021500150917      *--------------------------------------------------------------*
021600150917     C           #CHK01    BEGSR
021700240216     C*
021800240216     C                     MOVE *BLANK    W@1INC  1        1
021900240216     C*
022000240216     C*<<>>
022100150917     C                     DO   C#RECN    RRN1             S1
022200240216     C           RRN1      CHAINSFLREC               92
022300240216     C                     SETOF                     81
022400240216     C*
022500240216     C           XOPT      IFNE *BLANK                     S2
022600240216     C           XOPT      ANDNE'1'
022700240216     C                     SETON                     8199
022800150917     C                     Z-ADDRRN1      C#PGLN           
022900150917     C                     ENDIF                           E2
023000240219     C*
023100240219     C           XOPT      IFEQ '1'
023200240219     C                     MOVE '1'       W@1INC           1
023300240219     C                     ENDIF
023400240216     C*
023500240216     C                     UPDATSFLREC
023600240216     C*
023700150917     C                     ENDDO                           E1
023800240216     C*
023900150917     C                     ENDSR
024000090606      *--------------------------------------------------------------*
024100150917      *
024200090606      *--------------------------------------------------------------*
024300150917     C           #CALL1    BEGSR
024400151207      *
024500150917     C                     DO   C#RECN    RRN1             S1
024600240216     C           RRN1      CHAINSFLREC               65
024700090606      *
024800150917      *
024900150917     C                     EXSR #OPT
025000150917      *
025100240613     C*                    UPDATSFLREC
025200150917      *
025300150917     C                     ENDDO                           E1
025400090606      *
025500090606     C                     ENDSR
025600150917      *--------------------------------------------------------------*
025700150917      *
025800150917      *--------------------------------------------------------------*
025900150917     C           #OPT      BEGSR
026000240216     C*
026100150917     C                     SELEC                           S1
026200240613     C*      
026300240216     C           XOPT      WHEQ '1'                        X2
026400240216     C*            
026500240614     C*                    Z-ADDRRN1      PRRN1            
026600240614     C*                    ADD  1         PRRN1
026700240614     C                     Z-ADDRRNO2     PRRN1
026800240613     C                     CALL 'TD3579'  P#3578
026900240612     C                     ENDSL                           E1
027000150917      *
027100240216     C                     MOVE *BLANK    XOPT
027200150917      *
027300150917     C                     ENDSR
027400090606      *--------------------------------------------------------------*
027500090606      *
027600090606      *--------------------------------------------------------------*
027700090606     C           #END      BEGSR
027800090606      *
027900090606     C                     SETON                     LR
028000090606     C                     RETRN
028100090606      *
028200090606     C                     ENDSR
