000100240625/********************************************************************/
000200240625/**                                         CREATE  :  24/06/14    **/
000300240625/**  NB CL                     **/
000400240625/**                                         CHANGE  :  XX/XX/XX    **/
000500240625/**    PROG-ID : TD3578C                                           **/
000600240625/**                                         WRITER  : NOS NISHIGAKI**/
000700240625/********************************************************************/
000800240625/** 24/06/14 NOS NISHIGAKI*/
000900240625/********************************************************************/
001000240625
001100240625PGM
001200240625             DCL        VAR(&PCMD) TYPE(*CHAR) LEN(80)   /*ÊÞ¯ÁºÏÝÄÞ */
001300240625             CHGVAR     VAR(&PCMD)   VALUE('"C:\TOISNB\NBSND\NBSHAP.BAT"')
001400240625/*         */
001500240625             CALL       PGM(TD3578)
001600240625
001700240625/*          */
001800240625/*----------------------------*/
001900240625/*    */
002000240625/*----------------------------*/
002100240625/**/
002200240625/*----------------------------*/
002300240625/**/
002400240625/* ACS     */
002500240625        /*   STRPCCMD   PCCMD('RTOPCB.EXE +
002600240625                              "C:\SAVEF\.DTFX"') +
002700240625                        PAUSE(*NO)      */
002800240625/* CA                 */
002900240625/*           STRPCO                                  */
003000240625/*           MONMSG     MSGID(CPF0000 IWS4010)       */
003100240625/*                                                   */
003200240625/*           STRPCCMD   PCCMD('PCSFT5.EXE +          */
003300240625/*                            "C:\NB\RISONA.TTO"') + */
003400240625/*                             PAUSE(*NO)            */
003500240625
003600240625/* BAT                */
003700240625             STRPCO
003800240625             MONMSG     MSGID(CPF0000 IWS4010)
003900240625             STRPCCMD   PCCMD(&PCMD) +
004000240625                        PAUSE(*NO)
004100240625EXIT:
004200240625             ENDPGM
