000100000000    ?H*===============================================================*
000200240613     H*   PROGRAM      : 
000300240612     H*   PROGRAM    : 
000400240612     H*
000500000000    ?H*===============================================================*
000600240612     H*   CREATION DATE    :  2024/06/12
000700240612     H*   PROGRAMER NAME   :  NOS.NISHIGAKI
000800000000    ?H*===============================================================*
000900000000     H*   CHANGE HISTORY   :  ____/__/__
001000000000     H*                    :  _.__________ (___)
001100000000     H*                    : 
001200000000    ?H*===============================================================*
001300000000     H            Y/                                    1
001400000000    ?F*===============================================================*
001500000000     F*                      
001600000000    ?F*===============================================================*
001700000000    ?F*
001800240613     FTD3579FMCF  E                    WORKSTN      KINFDS #XWSID
001900000000    ?F*---------------------------------------------------------------*
002000000000    ?F*
002100000000    ?F*---------------------------------------------------------------*
002200000000    ?F*
002300240613     FNBSHAP  UF  E                    DISK
002400240613     F                                              KRECNO RRNO1
002500000000    ?F*---------------------------------------------------------------*
002600000000    ?F*---------------------------------------------------------------*
002700000000    ?F*
002800000000    ?F*---------------------------------------------------------------*
002900000000    ?F*
003000000000    ?E*===============================================================*
003100000000     E*                      
003200000000     E*----------------------------------------------------------------
003300000000    ?E*
003400000000     E*----------------------------------------------------------------
003500000000    ?E*
003600000000    ?I*===============================================================*
003700000000     I*                      
003800000000    ?I*===============================================================*
003900000000    ?I*===============================================================*
004000000000     I*                                                   *
004100000000    ?I*===============================================================*
004200000000    ?I*=======================================================*
004300000000     I*                                           *
004400000000    ?I*=======================================================*
004500000000     I*WSID
004600000000     I#XWSID      DS
004700000000     I                                      273 276 XWSID
004800000000    ?I*=======================================================*
004900000000     I*                      
005000000000     I           SDS
005100000000     I                                      244 247 XWSID2
005200000000    ?I*=======================================================*
005300000000    ?I*=======================================================*
005400000000     I*                                         *
005500000000    ?I*=======================================================*
005600000000     I*
005700000000     I            DS
005800000000     I                                        1  120WSYS
005900000000     I                                        1   60WTIME
006000000000     I                                        7  120WDATE
006100000000     I            DS
006200000000     I                                        1  10 DATE10
006300000000     I                                        1   40YYYY10
006400000000     I                                        5   5 F1
006500000000     I                                        6   70MM10
006600000000     I                                        8   8 F2
006700000000     I                                        9  100DD10
006800000000     I            DS
006900000000     I                                        1   80DATE8
007000000000     I                                        1   40YYYY8
007100000000     I                                        3   40YY2
007200000000     I                                        5   60MM8
007300000000     I                                        7   80DD8
007400000000     I            DS
007500000000     I                                        1   30WGMGNO
007600240612     I*
007700240612     I            DS
007800240612     I                                        1 250 NBS001
007900240612     I                                        1   10WDTKBN
008000240612     I*
008100240614     I                                        2  10 WDTRIY
008200240612     I                                       11  140WDTRBK
008300240612     I                                       15  29 WDTRBN
008400240612     I                                       30  320WDTRST
008500240612     I                                       33  47 WDTRSN
008600240612     I                                       48  480WDYKSH
008700240612     I                                       49  550WDKOUZ
008800240612     I                                       56  650WDSIKG
008900240612     I                                       66  730WDKIJT
009000240612     I                                       74  740WDJYOT
009100240612     I                                       75  94 WDKIRK
009200240612     I                                       95  95 WDHSZF
009300240612     I                                       96 135 WDREFN
009400240612     I                                      136 250 WDYOBI
009500000000    ?C*===============================================================*
009600000000     C*                      
009700000000    ?C*===============================================================*
009800000000    ?C*===============================================================*
009900000000     C*         
010000000000    ?C*===============================================================*
010100000000     C*<<>>
010200000000     C                     EXSR ##1ST                      
010300000000     C*
010400000000     C                     EXSR ##MAIN                     
010500000000     C*<<>>
010600000000     C                     EXSR ##END                      
010700000000    ?C*===============================================================*
010800000000     C*          ##1ST  :
010900000000    ?C*===============================================================*
011000000000    ?C           ##1ST     BEGSR
011100000000    ?C*----------------------------------------------------------------
011200000000    ?C*<<>>
011300000000     C*
011400000000     C           *ENTRY    PLIST
011500240613     C                     PARM           RRNO1   30       
011600240613     C******************************************************************
011700240613     C                     TIME           WSYS
011800000000     C                     MOVE XWSID     XWSID1
011900000000     C                     MOVE XWSID2    XWSID1
012000000000     C*
012100240613     C           RRNO1     CHAINNBSHAP               90
012200240612     C*
012300240613     C                     MOVELWDTRIY    X1004
012400240613     C*
012500240613     C                     MOVELWDTRBK    X1005
012600240613     C*
012700240613     C                     MOVELWDTRST    X1006
012800240613     C*
012900240613     C                     MOVELWDKOUZ    X1007
013000240613     C*
013100240613     C                     MOVELWDSIKG    X1008
013200000000     C                     ENDSR
013300000000     C******************************************
013400000000     C*
013500000000     C*
013600000000     C******************************************
013700000000     C           ##MAIN    BEGSR
013800240613     C*
013900240613     C                     EXSR GAMEN1
014000000000     C           END       ENDSR
014100000000     C******************************************
014200240613     C           GAMEN1    BEGSR
014300240613     C*
014400000000B001 C                     DO   *HIVAL
014500240613     C                     EXFMTTD3579D1
014600000000     C                     SETOF                     99
014700000000     C                     SETOF                     515253
014800000000     C                     SETOF                     545556
014900000000     C                     SETOF                     575859
015000000000     C                     SETOF                     6061
015100240613     C* CMD1 
015200240613B002 C           *INKA     IFEQ '1'
015300240613     C                     LEAVE
015400000000X002 C                     ELSE
015500240613     C                     ENDIF
015600240613     C* CMD4 
015700240613     C           *INKD     IFEQ '1'
015800240613     C*
015900240614     C                     MOVELX1004     WDTRIY  9
016000240613     C*
016100240613     C                     MOVELX1005     WDTRBK  40
016200240613     C*
016300240613     C                     MOVELX1006     WDTRST  30
016400240613     C*
016500240613     C                     MOVELX1007     WDKOUZ  70
016600240613     C*
016700240613     C                     MOVELX1008     WDSIKG 100
016800240614     C           X1008     IFNE 0
016900240614     C                     UPDATNBSHAR
017000240614     C                     LEAVE
017100240614     C                     ELSE
017200240614     C                     SETON                         55
017300240614     C                     ENDIF
017400240614     C                     ENDIF
017500240614     C                     ENDDO
017600240614     C                     ENDSR
017700000000     C******************************************
017800000000     C           ##END     BEGSR
017900240613     C           #END      TAG
018000000000     C                     SETON                     LR
018100000000     C                     RETRN
018200000000     C                     ENDSR
