000100240213     H*****************************************************************
000200240626     H*                                           CREATE; 24/06/26    *
000300240626     H*    PGM-NAME; TD3577                                           *
000400240213     H*                                           CHANGE; XX/XX/XX    *
000500240626     H*    CONTENTS;
000600240626     H*                                           WRITER; NOS KAMATA  *
000602240626     H*  
000604240626     H* --------------------------------------------------------------
000605240626     H*  /  /   NOS
000700240213     H*****************************************************************
000800940127     H            Y/                                    1
000900240213     F*****************************************************************
003100240626     F*
003200240626     FNBSHDP  IF  E                    DISK
003300240626     F*
003400240626     FNBSHTP  UF  E                    DISK
003900240213     I*****************************************************************
004100240222     I           SDS
004200240222     I                                      244 247 WWSID
008200240213     C*****************************************************************
008300240626     C*                    MAIN
008400240213     C*****************************************************************
008401240626     C                     EXSR #INZ
008600240626     C                     EXSR #MAIN
008601240626     C*
008602240626     C                     SETON                     LR
008603240626     C                     RETRN
009300940127     C*
009400240226     C*****************************************************************
009500240626     C*          #INZ     
009600240226     C*****************************************************************
009700240626     C           #INZ      BEGSR
009800240626     C*
009900240626     C                     Z-ADD*ZERO     WCNT    60       
010000240626     C                     Z-ADD*ZERO     WKIN   120       
013600240226     C*
013700240226     C                     ENDSR
013800240213     C*****************************************************************
013900240626     C*          #MAIN    
014000240213     C*****************************************************************
014100240626     C           #MAIN     BEGSR
014101240626     C*
014102240626     C*
014800240626     C           1         SETLLNBSHDP
015000240626     C                     DO   *HIVAL                     B1
015001240626     C                     READ NBSHDP                   91
015002240626     C   91                LEAVE
015003240626     C                     ADD  1         WCNT             
015004240626     C                     ADD  NDSIKG    WKIN             
015005240626     C                     ENDDO                           E1
015006240626     C*
015008240626     C           1         SETLLNBSHTP
015009240626     C                     READ NBSHTP                   92
015010240626     C           *IN92     IFEQ *ZERO                      B1
015011240626     C                     Z-ADDWCNT      NTGOKS           
015012240626     C                     Z-ADDWKIN      NTGOKG           
015013240626     C                     UPDATNBSHTR
015015240626     C                     ENDIF                           E1
016900240213     C*
017000940127     C                     ENDSR
