000100000000/********************************************************************/
000200240614/**                                         CREATE  :  24/06/14    **/
000300240614/**  NB CL                     **/
000400000000/**                                         CHANGE  :  XX/XX/XX    **/
000500240614/**    PROG-ID : TD3578C                                           **/
000600240604/**                                         WRITER  : NOS NISHIGAKI**/
000700000000/********************************************************************/
000800240614/** 24/06/14 NOS NISHIGAKI*/
000900240625/** 24/06/25 NOS NISHIGAKI                            */
001000000000/********************************************************************/
001100000000
001200240614PGM
001300240614             DCL        VAR(&PCMD) TYPE(*CHAR) LEN(80)   /*ÊÞ¯ÁºÏÝÄÞ */
001400240625/** 24/06/25 NOS NISHIGAKI                             */
001500240625/*           CHGVAR     VAR(&PCMD)   VALUE('"C:\NB\RISONA.BAT"')     */
001600240625/*           CHGVAR     VAR(&PCMD)   VALUE('"C:\TOISNB\NBSND\NBSHAP.BAT"') */
001700240614/*         */
001800240614             CALL       PGM(TD3578)
001900000000
002000240614/*          */
002100240614/*----------------------------*/
002200240614/*    */
002300240614/*----------------------------*/
002400240614/**/
002500240614/*----------------------------*/
002600240614/**/
002700240614/* ACS     */
002800240614        /*   STRPCCMD   PCCMD('RTOPCB.EXE +
002900240614                              "C:\SAVEF\.DTFX"') +
003000240614                        PAUSE(*NO)      */
003100240614/* CA                 */
003200240614/*           STRPCO                                  */
003300240614/*           MONMSG     MSGID(CPF0000 IWS4010)       */
003400240614/*                                                   */
003500240614/*           STRPCCMD   PCCMD('PCSFT5.EXE +          */
003600240614/*                            "C:\NB\RISONA.TTO"') + */
003700240614/*                             PAUSE(*NO)            */
003800240614
003900240614/* BAT                */
004000240625             STRPCO
004100240625             MONMSG     MSGID(CPF0000 IWS4010)
004200240625/** 24/06/25 NOS NISHIGAKI                            */
004300240625/*           STRPCCMD   PCCMD(&PCMD) +                              */
004400240625             STRPCCMD   PCCMD('C:\TOISNB\NBSND\NBSHAP.BAT') +
004500240625                        PAUSE(*NO)
004600000000EXIT:
004700000000             ENDPGM
