000100000000     A*****************************************************************
000200240613     A*                                           CREATE; 24/06/12    *
000300240613     A*    PGM-NAME; TD3579FM                                         *
000400000000     A*                                           CHANGE;   /  /      *
000500000000     A*    CONTENTS;          BY:   *
000600240613     A*    TOIS1                  WRITER; N.NISHIGAKI *
000700000000     A*****************************************************************
000800240612     A*24/06/12  NOS.NISHIGAKI                              *
000900000000     A****************************************************************
001000240613     A          R TD3579D1
001100240609     A                                      OVERLAY
001200240609     A                                      PROTECT
001300240612     A                                      CF01(01 '')
001400240612     A                                      CF04(04 '')
001500240613     A                                  1  2'TD3579'
001600240613     A                                  1 25''
001700240609     A                                      DSPATR(HI)
001800240609     A                                      DSPATR(RI)
001900240609     A                                  1 58DATE
002000240609     A                                      EDTCDE(9)
002100240609     A                                  1 67TIME
002200240609     A            XWSID1         4A  O  1 76
002300240613     A                                  2 25''
002400240613     A                                      DSPATR(HI RI)
002500240613     A                                      COLOR(BLU)
002600240612     A*           X1000         14A  O  2 31DSPATR(HI)
002700240612     A*                                     DSPATR(RI)
002800240612     A*                                     COLOR(BLU)
002900000000     A*
003000240613     A                                  8 22''
003100240613     A            X1004          9      8 40
003200240609     A  51                                  DSPATR(RI)
003300240609     A  51                                  DSPATR(PC)
003400000000     A*
003500240613     A                                 10 22''
003600240613     A            X1005          4     10 40
003700240609     A  52                                  DSPATR(RI)
003800240609     A  52                                  DSPATR(PC)
003900000000     A*
004000240613     A                                 12 22''
004100240613     A            X1006          3     12 40
004200240609     A  53                                  DSPATR(RI)
004300240609     A  53                                  DSPATR(PC)
004400000000     A*
004500240613     A                                 14 22''
004600240613     A            X1007          7D 0  14 40
004700240609     A  54                                  DSPATR(RI)
004800240609     A  54                                  DSPATR(PC)
004900000000     A*
005000240613     A                                 16 22''
005100240613     A            X1008         10  0B 16 40EDTCDE(Z)
005200240613     A  55                                  DSPATR(RI)
005300240609     A  55                                  DSPATR(PC)
005400000000     A*
005500240613     A                                 23  2'CMD1='
005600240613     A                                      COLOR(BLU)
005700240612     A                                 23 18'CMD4='
005800240613     A                                      COLOR(BLU)
