000100000000    ?H*===============================================================*
000200000000     H*   PROGRAM      : 
000300000000     H*   PROGRAM    : 
000400000000     H*                       TOIS1
000500000000    ?H*===============================================================*
000600000000     H*   CREATION DATE    :  2024/02/15
000700000000     H*   PROGRAMER NAME   :  Y.SUGIYAMA
000800000000    ?H*===============================================================*
000900000000     H*   CHANGE HISTORY   :  ____/__/__
001000000000     H*                    :  _.__________ (___)
001100000000     H*                    : 
001101240628    ?H*---------------------------------------------------------------*
001102240701     H*24/06/28 NOS KAMATA 
001103240701     H*                    
001104240701     H*                    
001105240701     H*                    
001106240701     H*                    
001107240701     H*                    
001108240701     H*                    
001109240701     H*                    
001200000000    ?H*===============================================================*
001300000000     H            Y/                                    1
001400000000    ?F*===============================================================*
001500000000     F*                      
001600000000    ?F*===============================================================*
001700000000    ?F*
001800000000     FTD3520FMCF  E                    WORKSTN      KINFDS #XWSID
001900000000    ?F*---------------------------------------------------------------*
002000000000    ?F*
002100000000    ?F*---------------------------------------------------------------*
002200000000    ?F*
002300000000     F*<<>>
002400000000     FTG1FLL03IF  E           K        DISK
002500000000     F*<<>>
002600000000     FTG2FLL03IF  E           K        DISK
002700000000     F*<<>>
002800000000     FTG1FLL01UF  E           K        DISK
002900000000     F            TG1FLR                            KRENAMETG1FLR1
003000000000     F*<<>>
003100000000     FTG2FLL01UF  E           K        DISK
003200000000     F            TG2FLR                            KRENAMETG2FLR1
003300000000    ?F*---------------------------------------------------------------*
003400000000    ?F*
003500000000     F*
003600000000     FGNMMSP  IF  E           K        DISK
003700000000     F*
003800000000     FMSGFLP  IF  E           K        DISK
003900000000    ?F*---------------------------------------------------------------*
004000000000    ?F*
004100000000    ?F*---------------------------------------------------------------*
004200000000    ?F*
004300000000    ?E*===============================================================*
004400000000     E*                      
004500000000     E*----------------------------------------------------------------
004600000000    ?E*
004700240607     E                    TABKBN  1   3  1  ATABNAM 22
004800000000     E*----------------------------------------------------------------
004900000000    ?E*
005000000000     E*
005100000000     E                    ANO      9999  6 0
005200000000     E*
005300000000     E                    XNO         8  6 0
005400000000     E*
005500000000     E                    A004     9999 10
005600000000     E*
005700000000     E                    A016     9999 30
005800000000     E*
005900000000     E                    ABKN     9999 24
006000000000     E* 
006100000000     E                    AKOZ     9999  7
006200000000     E*
006300000000     E*
006400000000     E                    AFL1     9999  8
006500000000     E*
006600000000     E                    ANKN     9999  6 0
006700000000     E*
006800000000     E                    A001     9999 11
006900000000     E*
007000000000     E                    A011     9999  9 0
007100000000     E*
007200000000     E                    A009     9999  8
007300000000     E*
007400000000     E                    A008     9999  3 0
007500000000     E*
007600000000     E                    A002     9999  6
007700000000    ?I*===============================================================*
007800000000     I*                      
007900000000    ?I*===============================================================*
008000000000    ?I*===============================================================*
008100000000     I*                                                   *
008200000000    ?I*===============================================================*
008300000000    ?I*=======================================================*
008400000000     I*                                           *
008500000000    ?I*=======================================================*
008600000000    ?I*=======================================================*
008700000000     I*                      
008800000000    ?I*=======================================================*
008900000000    ?I*=======================================================*
009000000000     I*                                         *
009100000000    ?I*=======================================================*
009200000000     I*WSID
009300000000     I#XWSID      DS
009400000000     I                                      273 276 XWSID
009500000000     I           SDS
009600000000     I                                      244 247 XWSID2
009700000000     I*
009800000000     I            DS
009900000000     I                                        1  120WSYS
010000000000     I                                        1   60WTIME
010100000000     I                                        7  120WDATE
010200000000     I            DS
010300000000     I                                        1   30WGMGNO
010400000000    ?C*===============================================================*
010500000000     C*                      
010600000000    ?C*===============================================================*
010700000000    ?C*===============================================================*
010800000000     C*         
010900000000    ?C*===============================================================*
011000000000     C*<<>>
011100000000     C                     EXSR ##1ST                      
011200000000     C*
011300000000     C                     EXSR ##MAIN                     
011400000000     C*<<>>
011500000000     C                     EXSR ##END                      
011600000000    ?C*===============================================================*
011700000000     C*          ##1ST  :
011800000000    ?C*===============================================================*
011900000000    ?C           ##1ST     BEGSR
012000000000    ?C*----------------------------------------------------------------
012100000000    ?C*<<>>
012200000000     C*
012300000000     C*
012400000000     C           *ENTRY    PLIST
012500000000     C                     PARM           PKUBUN  1        
012600000000     C* 
012700000000     C                     EXSR INIZSR
012800000000     C* 1=
012900000000     C* 2=
013000000000     C* 3=
013100000000     C*
013200000000     C           PKUBUN    LOKUPTABKBN    TABNAM         10
013300000000B001 C           *IN10     IFEQ '1'
013400000000     C                     MOVELTABNAM    XTKND
013500000000     C                     MOVE TABNAM    XNOT
013600000000E001 C                     ENDIF
013700000000     C                     TIME           WSYS
013800000000     C                     MOVE XWSID     XWSID1
013900000000     C                     MOVE XWSID2    XWSID1
014000000000     C                     EXSR DATASR
014100000000     C                     ENDSR
014200000000     C******************************************
014300000000     C*
014400000000     C*
014500000000     C******************************************
014600000000     C           ##MAIN    BEGSR
014700000000B001 C                     DO   *HIVAL
014800000000     C*
014900000000     C                     WRITETD3520C1
015000000000B002 C           I         IFEQ 0
015100000000     C*
015200000000     C                     Z-ADD165       WGMGNO  30
015300000000     C                     SETON                     99
015400000000     C                     EXSR ##MSG
015500000000X002 C                     ELSE
015600000000     C                     EXSR GSETSR
015700000000     C                     WRITETD3520S1
015800000000E002 C                     END
015900000000     C                     EXFMTTD3520M1
016000000000     C                     SETOF                     515253
016100000000     C                     SETOF                     545556
016200000000     C                     SETOF                     575859
016300000000     C                     SETOF                     606162
016400000000     C                     SETOF                     636465
016401240628     C*------------------------------------------------------
016402240701     C*
016403240628     C                     SETOF                     666768
016405240701     C*
016406240701     C                     SETOF                     99
016407240628     C*------------------------------------------------------
016500000000     C                     SETOF                     84
016600000000     C* CMD1 
016700000000B002 C           *INKA     IFEQ '1'
016800000000     C                     SETON                     LR
016900000000     C                     LEAVE
017000000000X002 C                     ELSE
017100000000     C* CMD9 
017200000000B003 C           *INKI     IFEQ '1'
017300000000     C                     Z-ADD0         PNO              
017400000000     C                     EXSR CALLSR
017500000000     C                     EXSR DATASR
017600000000X003 C                     ELSE
017700000000     C* CMD10 
017800000000B004 C           *INKK     IFEQ '1'
017900000000     C                     CLEARTD3520M1
018000000000X004 C                     ELSE
018100000000     C* CMD11 1
018200000000B005 C           *INKJ     IFEQ '1'
018300000000     C                     CLEARTD3520M1
018400000000     C           ZJ        SUB  16        ZJ      40
018500000000B006 C           ZJ        IFLT 0
018600000000     C                     Z-ADD0         ZJ
018700000000E006 C                     ENDIF
018800000000X005 C                     ELSE
018801240701     C*------------------------------------------------------
018802240701     C*
018804240701     C           I         CABEQ*ZERO     TAG2
018805240701     C*------------------------------------------------------
018900000000     C*=================================================
019000000000     C                     SETOF                     11
019100000000     C                     READ TD3520S1                 11
019101240701     C*------------------------------------------------------
019102240701     C           TAG2      TAG
019103240701     C*------------------------------------------------------
019200000000     C*
019300000000B006 C           XOPT1     IFNE '1'
019400000000     C           XOPT1     ANDNE'D'
019500000000     C           XOPT1     ANDNE' '
019600000000     C                     SETON                     6199
019700000000     C                     Z-ADD27        WGMGNO
019800000000     C                     EXSR ##MSG
019900000000E006 C                     ENDIF
020000000000     C*
020100000000B006 C           XOPT2     IFNE '1'
020200000000     C           XOPT2     ANDNE'D'
020300000000     C           XOPT2     ANDNE' '
020400000000     C                     SETON                     6299
020500000000     C                     Z-ADD27        WGMGNO
020600000000     C                     EXSR ##MSG
020700000000E006 C                     ENDIF
020800000000     C*
020900000000B006 C           XOPT3     IFNE '1'
021000000000     C           XOPT3     ANDNE'D'
021100000000     C           XOPT3     ANDNE' '
021200000000     C                     SETON                     6399
021300000000     C                     Z-ADD27        WGMGNO
021400000000     C                     EXSR ##MSG
021500000000E006 C                     ENDIF
021600000000     C*
021700000000B006 C           XOPT4     IFNE '1'
021800000000     C           XOPT4     ANDNE'D'
021900000000     C           XOPT4     ANDNE' '
022000000000     C                     SETON                     6499
022100000000     C                     Z-ADD27        WGMGNO
022200000000     C                     EXSR ##MSG
022300000000E006 C                     ENDIF
022400000000     C*
022500000000B006 C           XOPT5     IFNE '1'
022600000000     C           XOPT5     ANDNE'D'
022700000000     C           XOPT5     ANDNE' '
022800000000     C                     SETON                     6599
022900000000     C                     Z-ADD27        WGMGNO
023000000000     C                     EXSR ##MSG
023100000000E006 C                     ENDIF
023200000000     C*
023300000000B006 C           XOPT6     IFNE '1'
023400000000     C           XOPT6     ANDNE'D'
023500000000     C           XOPT6     ANDNE' '
023600000000     C                     SETON                     6699
023700000000     C                     Z-ADD27        WGMGNO
023800000000     C                     EXSR ##MSG
023900000000E006 C                     ENDIF
024000000000     C*
024100000000B006 C           XOPT7     IFNE '1'
024200000000     C           XOPT7     ANDNE'D'
024300000000     C           XOPT7     ANDNE' '
024400000000     C                     SETON                     6799
024500000000     C                     Z-ADD27        WGMGNO
024600000000     C                     EXSR ##MSG
024700000000E006 C                     ENDIF
024800000000     C*
024900000000B006 C           XOPT8     IFNE '1'
025000000000     C           XOPT8     ANDNE'D'
025100000000     C           XOPT8     ANDNE' '
025200000000     C                     SETON                     6899
025300000000     C                     Z-ADD27        WGMGNO
025400000000     C                     EXSR ##MSG
025500000000E006 C                     ENDIF
025501240628     C*------------------------------------------------------
025502240628     C*
025503240628     C           *IN99     IFEQ '1'
025504240628     C           ZJ        SUB  8         ZJ
025505240628     C           ZJ        IFLT 0
025506240628     C                     Z-ADD0         ZJ
025507240628     C                     ENDIF
025508240628     C                     ENDIF
025509240628     C*------------------------------------------------------
025600000000B006 C           *IN99     IFEQ '0'
025700000000     C* CMD4 
025800000000B007 C           *INKD     IFEQ '1'
025900000000     C           ZJ        SUB  8         ZJ
026000000000B008 C           ZJ        IFLT 0
026100000000     C                     Z-ADD0         ZJ
026200000000E008 C                     ENDIF
026300000000     C                     EXSR GCHECK
026400000000     C                     EXSR DATASR
026500000000     C                     ELSE
026600000000     C           ZJ        SUB  8         ZJ
026700000000B008 C           ZJ        IFLT 0
026800000000     C                     Z-ADD0         ZJ
026900000000E008 C                     ENDIF
027000000000     C                     SETON                     84
027100000000E007 C                     ENDIF
027200000000E006 C                     ENDIF
027300000000E005 C                     ENDIF
027400000000E004 C                     ENDIF
027500000000E003 C                     ENDIF
027600000000E002 C                     ENDIF
027700000000E001 C                     ENDDO
027800000000     C                     ENDSR
027900000000     C******************************************
028000000000     C*
028100000000     C*
028200000000     C******************************************
028300000000     C           CALLSR    BEGSR
028400000000B001 C           *INKI     IFEQ '1'
028500000000     C                     Z-ADD0         PNO
028600000000     C                     ELSE
028700000000     C                     Z-ADDXNO,N     PNO
028800000000E001 C                     ENDIF
028900000000     C*
029000000000B001 C           PKUBUN    IFEQ '1'
029100000000     C           PKUBUN    OREQ '2'
029200000000     C                     CALL 'TD3522'
029300000000     C                     PARM           PKUBUN  1
029400000000     C                     PARM           PNO     60
029500000000X001 C                     ELSE
029600000000     C*
029700000000B002 C           PKUBUN    IFEQ '3'
029800000000     C                     CALL 'TD3524'
029900000000     C                     PARM           PKUBUN  1
030000000000     C                     PARM           PNO     60
030100000000E002 C                     ENDIF
030200000000E001 C                     ENDIF
030300000000     C                     ENDSR
030400000000     C******************************************
030500000000     C*
030600000000     C*
030700000000     C******************************************
030800000000     C*
030900000000     C*
031000000000     C******************************************
031100000000     C           ##END     BEGSR
031200000000     C                     RETRN
031300000000     C                     ENDSR
031400000000     C******************************************
031500000000     C*
031600000000     C*
031700000000     C******************************************
031800000000     C           ##MSG     BEGSR
031900000000     C*
032000000000     C           WGMGNO    CHAINMSGFLP               71
032100000000B001 C           *IN71     IFEQ '1'
032200000000     C                     MOVE *BLANK    XERMS
032300000000X001 C                     ELSE
032400000000     C                     MOVELMGMGNM    XERMS
032500000000E001 C                     ENDIF
032600000000     C                     ENDSR
032700000000     C******************************************
032800000000     C*
032900000000     C*
033000000000     C******************************************
033100000000     C           SET1      BEGSR
033200000000     C                     EXSR INIZSR
033300000000     C*
033400000000     C           TGKEY     KLIST
033500000000     C                     KFLD           WDTK             
033600000000     C                     KFLD           WKFG             
033700000000     C                     MOVELPKUBUN    WDTK    1        
033800000000     C                     MOVEL'1'       WKFG    1        
033900240608      *=1 
034000000000     C                     EXSR ARSET1
034100240608      *
034200240608      *=0 
034300000000     C                     MOVEL'0'       WKFG             
034400000000     C                     EXSR ARSET1
034500240608      *
034600000000     C                     ENDSR
034700000000     C******************************************
034800000000     C*
034900000000     C*
035000000000     C******************************************
035100000000     C           ARSET1    BEGSR
035200240608     C*
035300000000     C                     SETOF                     11
035400000000     C           TGKEY     SETLLTG1FLL03
035500240608     C*
035600000000B001 C                     DO   *HIVAL
035700240608     C*
035800000000     C           TGKEY     READETG1FLL03                 11
035900240608     C*
036000000000B002 C           *IN11     IFEQ '1'
036100000000     C                     LEAVE
036200000000X002 C                     ELSE
036300000000B003 C           TG1RFG    IFEQ '0'
036400000000     C           TG1DFG    ANDEQ' '
036500000000     C*=0=' '
036600000000     C                     ADD  1         I
036700000000     C                     Z-ADDTG1NO     ANO,I            
036800000000     C                     MOVE TG1004    A004,I           
036900000000     C                     MOVELTG1016    A016,I           
037000240608      *
037100000000      *
037200000000     C                     MOVELTG1024    WBKCD   4
037300000000     C                     MOVELTG1026    WBRCD   3
037400000000     C                     MOVE *BLANK    BKBRNM 24
037500000000     C                     EXSR BANKSR
037600000000     C                     MOVELBKBRNM    ABKN,I
037700000000     C*                    MOVELXKOZA     AKOZ,I
037800000000     C*()
037900000000B004 C           TG1KFG    IFEQ '0'
038000000000     C                     MOVE *BLANK    AFL1,I
038100000000X004 C                     ELSE
038200000000B005 C           TG1KFG    IFEQ '1'
038300000000     C                     MOVEL''AFL1,I
038400000000X005 C                     ELSE
038500000000     C                     MOVEL''AFL1,I
038600000000E005 C                     ENDIF
038700000000E004 C                     ENDIF
038800000000     C                     Z-ADDTG1NKN    ANKN,I           
038900000000     C                     MOVE *BLANK    A001,I           
039000000000     C                     MOVELTG1001    A001,I           
039100000000     C                     Z-ADDTG1011    A011,I           
039200000000     C                     MOVE TG1009    A009,I           
039300000000     C                     Z-ADDTG1008    A008,I           
039400000000B004 C           TG1002    IFEQ '2'
039500000000     C*
039600000000     C                     MOVE ''  A002,I            
039700000000X004 C                     ELSE
039800000000     C                     MOVE *BLANK    A002,I
039900000000E004 C                     ENDIF
040000000000E003 C                     ENDIF
040100000000E002 C                     ENDIF
040200000000E001 C                     ENDDO
040300000000     C                     ENDSR
040400000000     C******************************************
040500000000     C*
040600000000     C*
040700000000     C******************************************
040800000000     C           SET2      BEGSR
040900000000     C                     EXSR INIZSR
041000000000     C*
041100000000     C                     MOVELPKUBUN    WDTK             
041200000000     C*=1 
041300000000     C                     MOVEL'1'       WKFG             
041400000000     C                     EXSR ARSET2
041500000000     C*=0 
041600000000     C                     MOVEL'0'       WKFG             
041700000000     C                     EXSR ARSET2
041800000000     C                     ENDSR
041900000000     C******************************************
042000000000     C*
042100000000     C*
042200000000     C******************************************
042300000000     C           ARSET2    BEGSR
042400000000     C                     SETOF                     11
042500000000     C           TGKEY     SETLLTG1FLL03
042600000000B001 C                     DO   *HIVAL
042700000000     C           TGKEY     READETG1FLL03                 11
042800000000B002 C           *IN11     IFEQ '1'
042900000000     C                     LEAVE
043000000000X002 C                     ELSE
043100000000B003 C           TG1RFG    IFEQ '0'
043200000000     C           TG1DFG    ANDEQ' '
043300000000     C*=0=' '
043400000000     C                     ADD  1         I
043500000000     C                     Z-ADDTG1NO     ANO,I            
043600000000     C                     MOVE TG1004    A004,I           
043700000000     C                     MOVELTG1016    A016,I           
043800000000     C*
043900000000     C                     MOVELTG1024    WBKCD
044000000000     C                     MOVELTG1026    WBRCD
044100000000     C                     MOVE *BLANK    BKBRNM
044200000000     C                     EXSR BANKSR
044300000000     C                     MOVELBKBRNM    ABKN,I
044400000000     C*                    MOVELXKOZA     AKOZ,I
044500000000     C*()
044600000000B004 C           TG1KFG    IFEQ '0'
044700000000     C                     MOVE *BLANK    AFL1,I
044800000000X004 C                     ELSE
044900000000B005 C           TG1KFG    IFEQ '1'
045000000000     C                     MOVEL''AFL1,I
045100000000X005 C                     ELSE
045200000000     C                     MOVEL''AFL1,I
045300000000E005 C                     ENDIF
045400000000E004 C                     ENDIF
045500000000     C                     Z-ADDTG1NKN    ANKN,I           
045600000000     C                     MOVE *BLANK    A001,I           
045700000000     C                     MOVELTG1001    A001,I           
045800000000     C                     Z-ADDTG1011    A011,I           
045900000000     C                     MOVE TG1009    A009,I           
046000000000     C                     Z-ADDTG1008    A008,I           
046100000000     C                     MOVE *BLANK    A002,I           
046200000000E003 C                     ENDIF
046300000000E002 C                     ENDIF
046400000000E001 C                     ENDDO
046500000000     C                     ENDSR
046600000000     C******************************************
046700000000     C*
046800000000     C*
046900000000     C******************************************
047000000000     C           SET3      BEGSR
047100000000     C                     EXSR INIZSR
047200000000     C*
047300000000     C                     MOVEL'1'       WDTK             
047400000000     C*=1 
047500000000     C                     MOVEL'1'       WKFG    1        
047600000000     C                     EXSR ARSET3
047700000000     C*=0 
047800000000     C                     MOVEL'0'       WKFG    1        
047900000000     C                     EXSR ARSET3
048000000000     C                     ENDSR
048100000000     C******************************************
048200000000     C*
048300000000     C*
048400000000     C******************************************
048500000000     C           ARSET3    BEGSR
048600240608      *
048700000000     C                     SETOF                     11
048800000000     C           TGKEY     SETLLTG2FLL03
048900240608      *
049000000000B001 C                     DO   *HIVAL
049100000000     C           TGKEY     READETG2FLL03                 11
049200000000B002 C           *IN11     IFEQ '1'
049300000000     C                     LEAVE
049400000000X002 C                     ELSE
049500000000B003 C           TG2RFG    IFEQ '0'
049600000000     C           TG2DFG    ANDEQ' '
049700000000     C*=0=' '
049800000000     C                     ADD  1         I
049900000000     C                     Z-ADDTG2NO     ANO,I            
050000000000     C                     MOVE TG2004    A004,I           
050100000000     C                     MOVELTG2012    A016,I           
050200000000     C*
050300000000     C                     MOVELTG2014    WBKCD            
050400000000     C                     MOVELTG2016    WBRCD            
050500000000     C                     MOVE *BLANK    BKBRNM           
050600000000     C                     EXSR BANKSR
050700000000     C                     MOVELBKBRNM    ABKN,I
050800000000     C*                    MOVELTG2019    AKOZ,I
050900000000     C*()
051000000000B004 C           TG2KFG    IFEQ '0'
051100000000     C                     MOVE *BLANK    AFL1,I
051200000000X004 C                     ELSE
051300000000B005 C           TG2KFG    IFEQ '1'
051400000000     C                     MOVEL''AFL1,I
051500000000X005 C                     ELSE
051600000000     C                     MOVEL''AFL1,I
051700000000E005 C                     ENDIF
051800000000E004 C                     ENDIF
051900000000     C                     Z-ADDTG2NKN    ANKN,I           
052000000000     C*1020
052100000000     C                     MOVE TG2003    A001,I           
052200000000     C*
052300000000     C                     Z-ADDTG2010    A011,I           
052400000000     C*
052500240608     C                     MOVE TG2008    A009,I           
052600000000     C                     Z-ADD0         A008,I           
052700000000     C                     MOVE *BLANK    A002,I           
052800000000E003 C                     ENDIF
052900000000E002 C                     ENDIF
053000000000E001 C                     ENDDO
053100240608      *
053200000000     C                     ENDSR
053300000000     C******************************************
053400000000     C*
053500000000     C*
053600000000     C******************************************
053700000000     C           BANKSR    BEGSR
053800000000     C*
053900000000     C           BKKEY     KLIST
054000000000     C                     KFLD           WBKCD
054100000000     C                     KFLD           WBRCD
054200240608      *
054300000000     C           BKKEY     CHAINGNMMSP               12
054400000000     C           *IN12     IFEQ '1'
054500000000     C                     MOVE *BLANK    GNGNNM
054600000000     C                     MOVE *BLANK    GNGSNM
054700000000     C                     SETOF                     12
054800000000     C                     ELSE
054900000000     C                     ENDIF
055000000000     C                     MOVELGNGNNM    P@DAT1
055100000000     C                     MOVELGNGSNM    P@DAT2
055200000000     C                     Z-ADD24        P@LEN1  30
055300000000     C*
055400000000     C                     CALL 'SUB010'
055500000000     C                     PARM           P@DAT1100
055600000000     C                     PARM           P@DAT2100
055700000000     C                     PARM           P@DAT3100
055800000000     C                     PARM           P@LEN1  30
055900000000     C                     PARM           P@LEN2  30
056000000000     C                     PARM           P@RE1 256
056100000000     C                     PARM           P@RE2 256
056200000000     C                     PARM           P@RE3 256
056300000000     C                     PARM           P@RTC   2
056400000000     C           P@RTC     IFEQ '00'
056500000000     C                     MOVELP@RE1     BKBRNM
056600000000     C                     ELSE
056700000000     C                     MOVELP@DAT1    BKBRNM
056800000000     C                     ENDIF
056900000000     C                     ENDSR
057000000000     C******************************************
057100000000     C*
057200000000     C*
057300000000     C******************************************
057400000000     C           INIZSR    BEGSR
057500000000     C                     Z-ADD0         I       40
057600000000     C                     Z-ADD0         J       40
057700000000     C                     Z-ADD0         ZJ      40
057800000000     C*
057900000000     C                     CLEARANO
058000000000     C                     CLEARXNO
058100000000     C*
058200000000     C                     CLEARA004
058300000000     C*
058400000000     C                     CLEARA016
058500000000     C*
058600000000     C                     CLEARABKN
058700000000     C* 
058800000000     C                     CLEARAKOZ
058900000000     C*
059000000000     C*
059100000000     C                     CLEARAFL1
059200000000     C*
059300000000     C                     CLEARANKN
059400000000     C*
059500000000     C                     CLEARA011
059600000000     C*
059700000000     C                     CLEARA011
059800000000     C*
059900000000     C                     CLEARA009
060000000000     C*
060100000000     C                     CLEARA008
060200000000     C*
060300000000     C                     CLEARA002
060400000000     C*
060500000000     C                     SETOF                     515253
060600000000     C                     SETOF                     545556
060700000000     C                     SETOF                     5758
060800000000     C                     SETOF                     616263
060900000000     C                     SETOF                     646566
061000000000     C                     SETOF                     676899
061100000000     C                     ENDSR
061200000000     C******************************************
061300000000     C*
061400000000     C*
061500000000     C******************************************
061600000000     C           GSETSR    BEGSR
061700000000     C* 
061800000000     C           ZJ        IFEQ 0
061900000000     C                     Z-ADD0         J       40
062000000000     C                     ELSE
062100000000     C                     Z-ADDZJ        J       40
062200000000     C                     ENDIF
062300000000     C                     ADD  1         J
062400000000     C* OPT
062500000000     C*                    MOVE *BLANK    XOPT1
062600000000     C*
062700000000     C                     Z-ADD1         M       10
062800000000     C                     Z-ADDANO,J     XNO,M
062900000000     C*
063000000000     C                     MOVE A004,J    X0041
063100000000     C*
063200000000     C                     MOVELA016,J    X0161
063300000000     C*
063400000000     C                     MOVELABKN,J    XBKB1
063500000000     C* 
063600000000     C*                    MOVELAKOZ,J    XKOZ1
063700000000     C*
063800000000     C*
063900000000     C                     MOVELAFL1,J    XFLG1
064000000000     C*
064100000000     C                     MOVELANKN,J    XNKN1
064200000000     C*
064300000000     C                     MOVELA001,J    X0011
064400000000     C*
064500000000     C                     Z-ADDA011,J    X0111
064600000000     C*
064700000000     C                     MOVE A009,J    X0091
064800000000     C*
064900000000     C                     MOVELA008,J    X0081
065000000000     C*
065100000000     C                     MOVELA002,J    X0021
065200000000     C*
065300000000     C*8,9(2)
065400000000     C                     ADD  1         J
065500000000     C           J         IFLE I
065600000000     C                     SETON                     52
065700000000     C* OPT
065800000000     C*                    MOVE *BLANK    XOPT2
065900000000     C*
066000000000     C                     Z-ADD2         M
066100000000     C                     Z-ADDANO,J     XNO,M
066200000000     C*
066300000000     C                     MOVE A004,J    X0042
066400000000     C*
066500000000     C                     MOVELA016,J    X0162
066600000000     C*
066700000000     C                     MOVELABKN,J    XBKB2
066800000000     C* 
066900000000     C*                    MOVELAKOZ,J    XKOZ2
067000000000     C*
067100000000     C*
067200000000     C                     MOVELAFL1,J    XFLG2
067300000000     C*
067400000000     C                     MOVELANKN,J    XNKN2
067500000000     C*
067600000000     C                     MOVELA001,J    X0012
067700000000     C*
067800000000     C                     Z-ADDA011,J    X0112
067900000000     C*
068000000000     C                     MOVE A009,J    X0092
068100000000     C*
068200000000     C                     MOVELA008,J    X0082
068300000000     C*
068400000000     C                     MOVELA002,J    X0022
068500000000     C                     ENDIF
068600000000     C*10,11(3)
068700000000     C                     ADD  1         J
068800000000     C           J         IFLE I
068900000000     C                     SETON                     53
069000000000     C* OPT
069100000000     C*
069200000000     C*
069300000000     C                     Z-ADD3         M
069400000000     C                     Z-ADDANO,J     XNO,M
069500000000     C*
069600000000     C                     MOVE A004,J    X0043
069700000000     C*
069800000000     C                     MOVELA016,J    X0163
069900000000     C*
070000000000     C                     MOVELABKN,J    XBKB3
070100000000     C* 
070200000000     C*                    MOVELAKOZ,J    XKOZ3
070300000000     C*
070400000000     C*
070500000000     C                     MOVELAFL1,J    XFLG3
070600000000     C*
070700000000     C                     MOVELANKN,J    XNKN3
070800000000     C*
070900000000     C                     MOVELA001,J    X0013
071000000000     C*
071100000000     C                     Z-ADDA011,J    X0113
071200000000     C*
071300000000     C                     MOVE A009,J    X0093
071400000000     C*
071500000000     C                     MOVELA008,J    X0083
071600000000     C*
071700000000     C                     MOVELA002,J    X0023
071800000000     C                     ENDIF
071900000000     C*12,13(4)
072000000000     C                     ADD  1         J
072100000000     C           J         IFLE I
072200000000     C                     SETON                     54
072300000000     C* OPT
072400000000     C*                    MOVE *BLANK    XOPT4
072500000000     C*
072600000000     C                     Z-ADD4         M
072700000000     C                     Z-ADDANO,J     XNO,M
072800000000     C*
072900000000     C                     MOVE A004,J    X0044
073000000000     C*
073100000000     C                     MOVELA016,J    X0164
073200000000     C*
073300000000     C                     MOVELABKN,J    XBKB4
073400000000     C* 
073500000000     C*                    MOVELAKOZ,J    XKOZ4
073600000000     C*
073700000000     C*
073800000000     C                     MOVELAFL1,J    XFLG4
073900000000     C*
074000000000     C                     MOVELANKN,J    XNKN4
074100000000     C*
074200000000     C                     MOVELA001,J    X0014
074300000000     C*
074400000000     C                     Z-ADDA011,J    X0114
074500000000     C*
074600000000     C                     MOVE A009,J    X0094
074700000000     C*
074800000000     C                     MOVELA008,J    X0084
074900000000     C*
075000000000     C                     MOVELA002,J    X0024
075100000000     C                     ENDIF
075200000000     C*14,15(5)
075300000000     C                     ADD  1         J
075400000000     C           J         IFLE I
075500000000     C                     SETON                     55
075600000000     C* OPT
075700000000     C*                    MOVE *BLANK    XOPT5
075800000000     C*
075900000000     C                     Z-ADD5         M
076000000000     C                     Z-ADDANO,J     XNO,M
076100000000     C*
076200000000     C                     MOVE A004,J    X0045
076300000000     C*
076400000000     C                     MOVELA016,J    X0165
076500000000     C*
076600000000     C                     MOVELABKN,J    XBKB5
076700000000     C* 
076800000000     C*                    MOVELAKOZ,J    XKOZ5
076900000000     C*
077000000000     C*
077100000000     C                     MOVELAFL1,J    XFLG5
077200000000     C*
077300000000     C                     MOVELANKN,J    XNKN5
077400000000     C*
077500000000     C                     MOVELA001,J    X0015
077600000000     C*
077700000000     C                     Z-ADDA011,J    X0115
077800000000     C*
077900000000     C                     MOVE A009,J    X0095
078000000000     C*
078100000000     C                     MOVELA008,J    X0085
078200000000     C*
078300000000     C                     MOVELA002,J    X0025
078400000000     C                     ENDIF
078500000000     C*16,17(6)
078600000000     C                     ADD  1         J
078700000000     C           J         IFLE I
078800000000     C                     SETON                     56
078900000000     C* OPT
079000000000     C*                    MOVE *BLANK    XOPT6
079100000000     C*
079200000000     C                     Z-ADD6         M
079300000000     C                     Z-ADDANO,J     XNO,M
079400000000     C*
079500000000     C                     MOVE A004,J    X0046
079600000000     C*
079700000000     C                     MOVELA016,J    X0166
079800000000     C*
079900000000     C                     MOVELABKN,J    XBKB6
080000000000     C* 
080100000000     C*                    MOVELAKOZ,J    XKOZ6
080200000000     C*
080300000000     C*
080400000000     C                     MOVELAFL1,J    XFLG6
080500000000     C*
080600000000     C                     MOVELANKN,J    XNKN6
080700000000     C*
080800000000     C                     MOVELA001,J    X0016
080900000000     C*
081000000000     C                     Z-ADDA011,J    X0116
081100000000     C*
081200000000     C                     MOVE A009,J    X0096
081300000000     C*
081400000000     C                     MOVELA008,J    X0086
081500000000     C*
081600000000     C                     MOVELA002,J    X0026
081700000000     C                     ENDIF
081800000000     C*18,19(7)
081900000000     C                     ADD  1         J
082000000000     C           J         IFLE I
082100000000     C                     SETON                     57
082200000000     C* OPT
082300000000     C*                    MOVE *BLANK    XOPT7
082400000000     C*
082500000000     C                     Z-ADD7         M
082600000000     C                     Z-ADDANO,J     XNO,M
082700000000     C*
082800000000     C                     MOVE A004,J    X0047
082900000000     C*
083000000000     C                     MOVELA016,J    X0167
083100000000     C*
083200000000     C                     MOVELABKN,J    XBKB7
083300000000     C* 
083400000000     C*                    MOVELAKOZ,J    XKOZ7
083500000000     C*
083600000000     C*
083700000000     C                     MOVELAFL1,J    XFLG7
083800000000     C*
083900000000     C                     MOVELANKN,J    XNKN7
084000000000     C*
084100000000     C                     MOVELA001,J    X0017
084200000000     C*
084300000000     C                     Z-ADDA011,J    X0117
084400000000     C*
084500000000     C                     MOVE A009,J    X0097
084600000000     C*
084700000000     C                     MOVELA008,J    X0087
084800000000     C*
084900000000     C                     MOVELA002,J    X0027
085000000000     C                     ENDIF
085100000000     C*20,21(8)
085200000000     C                     ADD  1         J
085300000000     C           J         IFLE I
085400000000     C                     SETON                     58
085500000000     C* OPT
085600000000     C*                    MOVE *BLANK    XOPT8
085700000000     C*
085800000000     C                     Z-ADD8         M
085900000000     C                     Z-ADDANO,J     XNO,M
086000000000     C*
086100000000     C                     MOVE A004,J    X0048
086200000000     C*
086300000000     C                     MOVELA016,J    X0168
086400000000     C*
086500000000     C                     MOVELABKN,J    XBKB8
086600000000     C* 
086700000000     C*                    MOVELAKOZ,J    XKOZ8
086800000000     C*
086900000000     C*
087000000000     C                     MOVELAFL1,J    XFLG8
087100000000     C*
087200000000     C                     MOVELANKN,J    XNKN8
087300000000     C*
087400000000     C                     MOVELA001,J    X0018
087500000000     C*
087600000000     C                     Z-ADDA011,J    X0118
087700000000     C*
087800000000     C                     MOVE A009,J    X0098
087900000000     C*
088000000000     C                     MOVELA008,J    X0088
088100000000     C*
088200000000     C                     MOVELA002,J    X0028
088300000000     C                     ENDIF
088400000000     C           I         IFGT J
088500000000     C                     SETON                     71
088600000000     C                     ELSE
088700000000     C                     SETOF                     71
088800000000     C                     ENDIF
088900000000     C           J         IFGT 8
089000000000     C                     SETON                     70
089100000000     C                     ELSE
089200000000     C                     SETOF                     70
089300000000     C                     ENDIF
089400000000     C                     Z-ADDJ         ZJ
089500000000     C                     ENDSR
089600000000     C******************************************
089700000000     C*
089800000000     C*
089900000000     C******************************************
090000000000     C           GCHECK    BEGSR
090100000000     C                     Z-ADD0         GN      10
090200000000     C*1
090300000000     C                     Z-ADD1         N       10
090400000000     C           ZJ        ADD  1         K       40
090500000000B001 C           XOPT1     IFEQ '1'
090600000000     C*
090700000000     C                     EXSR CALLSR
090800000000X001 C                     ELSE
090900000000B002 C           XOPT1     IFEQ 'D'
091000000000     C*
091100000000     C                     EXSR DELSR
091200000000B002 C                     ENDIF
091300000000B001 C                     ENDIF
091400000000     C                     MOVE *BLANK    XOPT1
091500000000     C*---------------------------------------------------
091600000000     C*2
091700000000     C           ZJ        ADD  2         K
091800000000     C                     Z-ADD2         N
091900000000B001 C           K         IFLE J
092000000000B002 C           XOPT2     IFEQ '1'
092100000000     C*
092200000000     C                     EXSR CALLSR
092300000000X002 C                     ELSE
092400000000B003 C           XOPT3     IFEQ 'D'
092500000000     C*
092600000000     C                     EXSR DELSR
092700000000B003 C                     ENDIF
092800000000B002 C                     ENDIF
092900000000B001 C                     ENDIF
093000000000     C                     MOVE *BLANK    XOPT2
093100000000     C*---------------------------------------------------
093200000000     C*3
093300000000     C                     Z-ADD3         N       10
093400000000     C           ZJ        ADD  3         K       40
093500000000B001 C           K         IFLE J
093600000000B002 C           XOPT3     IFEQ '1'
093700000000     C*
093800000000     C                     EXSR CALLSR
093900000000X002 C                     ELSE
094000000000B003 C           XOPT3     IFEQ 'D'
094100000000     C*
094200000000     C                     EXSR DELSR
094300000000B003 C                     ENDIF
094400000000B002 C                     ENDIF
094500000000B001 C                     ENDIF
094600000000     C                     MOVE *BLANK    XOPT3
094700000000     C*---------------------------------------------------
094800000000     C*4
094900000000     C                     Z-ADD4         N       10
095000000000     C           ZJ        ADD  4         K       40
095100000000B001 C           K         IFLE J
095200000000B002 C           XOPT4     IFEQ '1'
095300000000     C*
095400000000     C                     EXSR CALLSR
095500000000X002 C                     ELSE
095600000000B003 C           XOPT4     IFEQ 'D'
095700000000     C*
095800000000     C                     EXSR DELSR
095900000000B003 C                     ENDIF
096000000000B002 C                     ENDIF
096100000000B001 C                     ENDIF
096200000000     C                     MOVE *BLANK    XOPT4
096300000000     C*---------------------------------------------------
096400000000     C*5
096500000000     C                     Z-ADD5         N       10
096600000000     C           ZJ        ADD  5         K       40
096700000000B001 C           K         IFLE J
096800000000B002 C           XOPT5     IFEQ '1'
096900000000     C*
097000000000     C                     EXSR CALLSR
097100000000X002 C                     ELSE
097200000000B003 C           XOPT5     IFEQ 'D'
097300000000     C*
097400000000     C                     EXSR DELSR
097500000000B003 C                     ENDIF
097600000000B002 C                     ENDIF
097700000000B001 C                     ENDIF
097800000000     C                     MOVE *BLANK    XOPT5
097900000000     C*---------------------------------------------------
098000000000     C*6
098100000000     C                     Z-ADD6         N       10
098200000000     C           ZJ        ADD  6         K       40
098300000000B001 C           K         IFLE J
098400000000B002 C           XOPT6     IFEQ '1'
098500000000     C*
098600000000     C                     EXSR CALLSR
098700000000X002 C                     ELSE
098800000000B003 C           XOPT6     IFEQ 'D'
098900000000     C*
099000000000     C                     EXSR DELSR
099100000000B003 C                     ENDIF
099200000000B002 C                     ENDIF
099300000000B001 C                     ENDIF
099400000000     C                     MOVE *BLANK    XOPT6
099500000000     C*---------------------------------------------------
099600000000     C*7
099700000000     C                     Z-ADD7         N       10
099800000000     C           ZJ        ADD  7         K       40
099900000000B001 C           K         IFLE J
100000000000B002 C           XOPT7     IFEQ '1'
100100000000     C*
100200000000     C                     EXSR CALLSR
100300000000X002 C                     ELSE
100400000000B003 C           XOPT7     IFEQ 'D'
100500000000     C*
100600000000     C                     EXSR DELSR
100700000000B003 C                     ENDIF
100800000000B002 C                     ENDIF
100900000000B001 C                     ENDIF
101000000000     C                     MOVE *BLANK    XOPT7
101100000000     C*---------------------------------------------------
101200000000     C*8
101300000000     C                     Z-ADD8         N       10
101400000000     C           ZJ        ADD  8         K       40
101500000000B001 C           K         IFLE J
101600000000B002 C           XOPT8     IFEQ '1'
101700000000     C*
101800000000     C                     EXSR CALLSR
101900000000X002 C                     ELSE
102000000000B003 C           XOPT8     IFEQ 'D'
102100000000     C*
102200000000     C                     EXSR DELSR
102300000000B003 C                     ENDIF
102400000000B002 C                     ENDIF
102500000000B001 C                     ENDIF
102600000000     C                     MOVE *BLANK    XOPT8
102700000000     C*---------------------------------------------------
102800000000     C                     ENDSR
102900000000     C******************************************
103000000000     C*
103100000000     C*
103200000000     C******************************************
103300000000     C           DELSR     BEGSR
103400000000     C*
103500000000     C                     Z-ADDXNO,N     WNO     60
103600000000B001 C           PKUBUN    IFEQ '1'
103700000000     C           PKUBUN    OREQ '2'
103800000000     C           WNO       CHAINTG1FLL01             91
103900000000B002 C           *IN91     IFEQ '1'
104000000000     C                     SETOF                     91
104100000000X002 C                     ELSE
104200000000     C                     MOVEL'D'       TG1DFG           
104300000000     C           WDATE     ADD  20000000  TG1UPD           
104400000000     C                     Z-ADDWTIME     TG1UPT           
104500000000     C                     MOVELXWSID2    TG1UPW           ID
104600000000     C                     UPDATTG1FLR1
104700000000E002 C                     ENDIF
104800000000X001 C                     ELSE
104900000000B002 C           PKUBUN    IFEQ '3'
105000000000     C           WNO       CHAINTG2FLL01             91
105100000000B003 C           *IN91     IFEQ '1'
105200000000     C                     SETOF                     91
105300000000X003 C                     ELSE
105400000000     C                     MOVEL'D'       TG2DFG           
105500000000     C           WDATE     ADD  20000000  TG2UPD           
105600000000     C                     Z-ADDWTIME     TG2UPT           
105700000000     C                     MOVELXWSID2    TG2UPW           ID
105800000000     C                     UPDATTG2FLR1
105900000000E003 C                     ENDIF
106000000000E002 C                     ENDIF
106100000000E001 C                     ENDIF
106200000000     C                     ENDSR
106300000000     C******************************************
106400000000     C*
106500000000     C*
106600000000     C******************************************
106700000000     C           DATASR    BEGSR
106800000000     C*
106900000000B001 C           PKUBUN    IFEQ '1'
107000000000     C*
107100000000     C                     EXSR SET1
107200000000X001 C                     ELSE
107300000000B002 C           PKUBUN    IFEQ '2'
107400000000     C*
107500000000     C                     EXSR SET2
107600000000X002 C                     ELSE
107700000000     C*
107800000000B003 C           PKUBUN    IFEQ '3'
107900000000     C                     EXSR SET3
108000000000E003 C                     ENDIF
108100000000E002 C                     ENDIF
108200000000E001 C                     ENDIF
108300000000     C                     ENDSR
108400000000     C******************************************
108500240607     C**  24/06/07 NOS.NISHIGAKI *******
108600000000** TABKBN/TABNAM 
1087002406071
1088002406072
1089002406073
