000100970331     H*****************************************************************
000200240603     H*    CONTENTS;                      *
000300240603     H*                                           CRE2TE; 24/06/03    *
000400240603     H*                                           CHANGE; 00/00/00    *
000500240603     H*                                           WRITER; N.NISHIGAKI *
000600970331     H*****************************************************************
000700240603     H*24/06/03 N.NISHIGAKI
000800030617     H*****************************************************************
000900030617     H            Y                                     1
001000240603     F*
001100240604     FSHAFLL14IF  E           K        DISK
001200240604     F*           NKNFLR                            KRENAMESHAFLR14
001300240603     F*
001400240604     FSHAFLPZ O   E           K        DISK
001500970331     I*****************************************************************
001600970331     I*                                                     *
001700970331     I*****************************************************************
001800240603     I            DS
001900240603     I                                        1   60WUYMD
002000240603     I                                        1   20WUYY
002100240603     I                                        3   40WUMM
002200240603     I                                        5   60WUDD
002300970331     C*****************************************************************
002400970331     C*                    MAINROUTINE                                *
002500970331     C*****************************************************************
002600970331     C*
002700970331     C                     EXSR @INT
002800240604     C                     CLEARSHAFLZ
002900970331     C*
003000240603     C                     Z-ADDUDATE     DATE    60
003100240604     C           DATE      SETLLSHAFLL14
003200240603     C           *IN20     DOWEQ'0'
003300240604     C           DATE      READESHAFLL14                 20
003400240604     C           *IN20     IFEQ '0'
003500970730   #@C        N20          EXSR S#@C01
003600240604     C                     WRITESHAFLZ
003700240604     C                     END
003800240603     C                     ENDDO
003900970331     C*
004000970331     C*
004100970331     C                     SETON                     LR
004200970331     C                     RETRN
004300970331     C*****************************************************************
004400970331     C*          @INT      SUBROUTINE                                 *
004500970331     C*****************************************************************
004600970331     C           @INT      BEGSR
004700970331     C*
004800970331     C                     MOVEL*ALL'0'   *IN               FLG CLEAR
004900240604     C                     MOVE *BLANK    SHJTCD           º°ÄÞ
005000240604     C                     Z-ADD*ZERO     SHSHNO           
005100240604     C                     Z-ADD*ZERO     SHSHDT           
005200240604     C                     MOVE *BLANK    SHSRKB            
005300240604     C                     MOVE *BLANK    SHSICD           º°ÄÞ
005400240604     C                     MOVE *BLANK    SHSTCD           º°ÄÞ
005500240604     C                     Z-ADD*ZERO     SHSHKG           
005600240604     C                     MOVE *BLANK    SHTEKI           
005700240604     C                     Z-ADD*ZERO     SHKSDT           
005800240604     C                     Z-ADD*ZERO     SHSAIT           
005900240604     C                     MOVE *BLANK    SHTGNO           
006000240604     C                     MOVE *BLANK    SHTGKB            
006100240604     C                     MOVE *BLANK    SHGNCD           º°ÄÞ
006200240604     C                     MOVE *BLANK    SHGSCD           º°ÄÞ
006300240604     C                     MOVE *BLANK    SHFLG1            Ì×¸Þ1
006400240604     C                     MOVE *BLANK    SHFLG2            Ì×¸Þ2
006500240604     C                     MOVE *BLANK    SHFLG3            Ì×¸Þ3
006600240604     C                     Z-ADD*ZERO     SHETK1           1
006700240604     C                     Z-ADD*ZERO     SHETK2           2
006800240604     C                     Z-ADD*ZERO     SHETK3           3
006900240604     C                     MOVE *BLANK    SHINWS           ID
007000240604     C                     Z-ADD*ZERO     SHINDT           
007100240604     C                     Z-ADD*ZERO     SHINTM           
007200240604     C                     MOVE *BLANK    SHUPWS           ID
007300240604     C                     Z-ADD*ZERO     SHUPDT           
007400240604     C                     Z-ADD*ZERO     SHUPTM           
007500240604     C                     MOVE *BLANK    SHUPPG           ÌßÛ¸Þ×Ñ
007600240604     C                     Z-ADD*ZERO     SHIND@           
007700240604     C                     Z-ADD*ZERO     SHKSD@           
007800240604     C                     Z-ADD*ZERO     SHSHD@           
007900240604     C                     Z-ADD*ZERO     SHUPD@            
008000240604     C                     MOVE *BLANK    #@082\            Ì×¸Þ
008100240604     C*
008200970331     C                     ENDSR
008300970730   #@C*==============================================================*
008400970730   #@C*          S#@C01   
008500970730   #@C*==============================================================*
008600970730   #@C           S#@C01    BEGSR
008700970730   #@C*
008800240604   #@C                     MOVE SHIND@    SHINDT
008900240604   #@C                     MOVE SHKSD@    SHKSDT
009000240604   #@C                     MOVE SHSHD@    SHSHDT
009100240604   #@C                     MOVE SHUPD@    SHUPDT
009200240604   #@C                     MOVE SHIND@    SHIND@  80
009300240604   #@C                     MOVE SHKSD@    SHKSD@  80
009400240604   #@C                     MOVE SHSHD@    SHSHD@  80
009500240604   #@C                     MOVE SHUPD@    SHUPD@  80
009600970730   #@C*
009700970730   #@C                     ENDSR
009800970730   #@C*==============================================================*
