000100970331     H*****************************************************************
000200240603     H*    CONTENTS;                      *
000300240603     H*                                           CRE2TE; 24/06/03    *
000400240603     H*                                           CHANGE; 00/00/00    *
000500240603     H*                                           WRITER; N.NISHIGAKI *
000600970331     H*****************************************************************
000700240603     H*24/06/03 N.NISHIGAKI
000800030617     H*****************************************************************
000900030617     H            Y                                     1
001000240603     F*
001100240603     FNKNFLL13IF  E           K        DISK
001200240603     F            NKNFLR                            KRENAMENKNFLR13
001300240603     F*
001400240603     FNKNFLPZ O   E           K        DISK
001500970331     I*****************************************************************
001600970331     I*                                                     *
001700970331     I*****************************************************************
001800240603     I            DS
001900240603     I                                        1   60WUYMD
002000240603     I                                        1   20WUYY
002100240603     I                                        3   40WUMM
002200240603     I                                        5   60WUDD
002300970331     C*****************************************************************
002400970331     C*                    MAINROUTINE                                *
002500970331     C*****************************************************************
002600970331     C*
002700970331     C                     EXSR @INT
002800240605     C                     CLEARNKNFLZ
002900970331     C*
003000240603     C                     Z-ADDUDATE     DATE    60
003100240603     C           DATE      SETLLNKNFLL13
003200240603     C           *IN20     DOWEQ'0'
003300240603     C           DATE      READENKNFLL13                 20
003400240604     C           *IN20     IFEQ '0'
003500970730   #@C        N20          EXSR S#@C01
003600240605     C                     WRITENKNFLZ
003700240604     C                     END
003800240603     C                     ENDDO
003900970331     C*
004000970331     C*
004100970331     C                     SETON                     LR
004200970331     C                     RETRN
004300970331     C*****************************************************************
004400970331     C*          @INT      SUBROUTINE                                 *
004500970331     C*****************************************************************
004600970331     C           @INT      BEGSR
004700970331     C*
004800970331     C                     MOVEL*ALL'0'   *IN               FLG CLEAR
004900240603     C                     MOVE *BLANK    NKJTCD           º°ÄÞ
005000240603     C                     Z-ADD*ZERO     NKNKNO           
005100240603     C                     Z-ADD*ZERO     NKNKDT           
005200240603     C                     MOVE *BLANK    NKSRKB            
005300240603     C                     MOVE *BLANK    NKTOCD           º°ÄÞ
005400240603     C                     MOVE *BLANK    NKSTCD           º°ÄÞ
005500240603     C                     Z-ADD*ZERO     NKNKKG           
005600240603     C                     MOVE *BLANK    NKTEKI           
005700240603     C                     Z-ADD*ZERO     NKKSDT           
005800240603     C                     Z-ADD*ZERO     NKSAIT           
005900240603     C                     MOVE *BLANK    NKTGNO           
006000240603     C                     MOVE *BLANK    NKTGKB            
006100240603     C                     MOVE *BLANK    NKFLG1            Ì×¸Þ1
006200240603     C                     MOVE *BLANK    NKFLG2            Ì×¸Þ2
006300240603     C                     MOVE *BLANK    NKFLG3            Ì×¸Þ3
006400240603     C                     Z-ADD*ZERO     NKETK1           1
006500240603     C                     Z-ADD*ZERO     NKETK2           2
006600240603     C                     Z-ADD*ZERO     NKETK3           3
006700240603     C                     MOVE *BLANK    NKINWS           ID
006800240603     C                     Z-ADD*ZERO     NKINDT           
006900240603     C                     Z-ADD*ZERO     NKINTM           
007000240603     C                     MOVE *BLANK    NKUPWS           ID
007100240603     C                     Z-ADD*ZERO     NKUPDT           
007200240603     C                     Z-ADD*ZERO     NKUPTM           
007300240603     C                     MOVE *BLANK    NKUPPG           ÌßÛ¸Þ×Ñ
007400240603     C                     Z-ADD*ZERO     NKIND@           
007500240603     C                     Z-ADD*ZERO     NKKSD@           
007600240603     C                     Z-ADD*ZERO     NKNKD@           
007700240603     C                     Z-ADD*ZERO     NKUPD@           
007800240603     C                     MOVE *BLANK    #@067\           Ì×¸Þ
007900970331     C*
008000970331     C                     ENDSR
008100970730   #@C*==============================================================*
008200970730   #@C*          S#@C01   
008300970730   #@C*==============================================================*
008400970730   #@C           S#@C01    BEGSR
008500970730   #@C*
008600240603   #@C                     MOVE NKIND@    NKINDT
008700240603   #@C                     MOVE NKKSD@    NKKSDT
008800240603   #@C                     MOVE NKNKD@    NKNKDT
008900240603   #@C                     MOVE NKUPD@    NKUPDT
009000240603   #@C                     MOVE NKIND@    NKIND@  80
009100240603   #@C                     MOVE NKKSD@    NKKSD@  80
009200240603   #@C                     MOVE NKNKD@    NKNKD@  80
009300240603   #@C                     MOVE NKUPD@    NKUPD@  80
009400970730   #@C*
009500970730   #@C                     ENDSR
009600970730   #@C*==============================================================*
