000100240625/********************************************************************/
000200240625/**                                         CREATE  :  24/06/14    **/
000300240625/**  NB CL                     **/
000400240625/**                                         CHANGE  :  XX/XX/XX    **/
000500240625/**    PROG-ID : TD3577C                                           **/
000600240625/**                                         WRITER  : NOS NISHIGAKI**/
000700240625/********************************************************************/
000800240625/** 24/06/14 NOS NISHIGAKI*/
000900240625/********************************************************************/
001000240625
001100240625             PGM
001200240625             DCL        VAR(&PCMD) TYPE(*CHAR) LEN(80)   /*ÊÞ¯ÁºÏÝÄÞ */
001300240625             CHGVAR     VAR(&PCMD)   VALUE('"C:\TOISNB\NBSND\NBSHHP.BAT"')
001400240625/*         */
001500240625             CHGDTA DFUPGM(DF_NBSHD)
001600240625
001700240625/*          */
001800240625/*----------------------------*/
001900240625/**/
002000240625/*----------------------------*/
002100240625/*      */
002200240625/*----------------------------*/
002300240625/**/
002400240625/* CA                 */
002500240625/*           STRPCO                                      */
002600240625/*           MONMSG     MSGID(CPF0000 IWS4010)           */
002700240625/*                                                       */
002800240625/*           STRPCCMD   PCCMD('PCSFT5.EXE +              */
002900240625/*                            "C:\NB\MITUBISI.TTO"') +   */
003000240625/*                                PAUSE(*NO)             */
003100240625
003200240625/* BAT                 */
003300240625             STRPCO
003400240625             MONMSG     MSGID(CPF0000 IWS4010)
003500240625             STRPCCMD   PCCMD(&PCMD) +
003600240625                        PAUSE(*NO)
003700240625
003800240625EXIT:
003900240625             ENDPGM
