000100980416     A****************************************************************
000200980416     A**  **    **                        **
000300980416     A**                                    CREATE  :  XX/XX/XX     **
000400980416     A**                                    CHANGE  :  XX/XX/XX     **
000500980416     A**    PROG-ID : TMN31FM               WRITER  :  YBS          **
000600980416     A****************************************************************
000700980416     A*98/04/16 M.KOTAKA             *
000800980416     A*                              *
000900000229     A*00/02/29 M.KOTAKA     *
001000001102     A*00/11/02 M.KOTAKA     *
001100081222     A*08/12/22 M.KOTAKA *
001200090317     A*09/03/17 M.KOTAKA FAX *
001300130508     A*13/05/08 M.KOTAKA *
001400130508     A*13/05/08 M.KOTAKA *
001500130522     A*13/05/22 M.KOTAKA EDI *
001600151214     A*15/12/15 M.KOTAKA             *
001700170117     A*17/01/17 M.KOTAKA             *
001800240530     A*24/05/30 O.NOS    FAXFAXIMO*
001900240705     A*24/07/05 N.NOS              *
002000980416     A****************************************************************
002100910327     A                                      PRINT
002200910327     A          R TMN31R
002300910327     A                                  1  2'TMN31'
002400910327     A                                  1 27''
002500910327     A                                      DSPATR(RI HI)
002600000229     A*                                 1 59DATE EDTCDE(Y)
002700000229     A                                  1 59DATE EDTCDE(9)
002800910327     A                                  1 68TIME
002900910327     A            XWSID          4      1 77
003000910327     A                                  4  5'01 :'
003100910327     A                                  5  5'02 :'
003200910327     A                                  6  5'03 :'
003300910327     A                                  7  5'04 :'
003400910327     A                                  8  5'05 :'
003500910327     A                                  9  5'06 :'
003600910327     A                                 10  5'07 :'
003700910327     A                                 11  5'08 :'
003800910327     A                                 12  5'09 :'
003900910327     A                                 13  5'10 :'
004000910327     A                                 14  5'11 :'
004100910327     A                                 15  5'12 :'
004200910327     A                                 16  5'13 :'
004300910327     A                                 17  5'14 :'
004400910327     A                                 18  5'15 :'
004500910327     A                                 19  5'16 :'
004600910327     A*
004700910327     A                                  4 44'21 :'
004800910327     A                                  5 44'22 :'
004900910327     A                                  6 44'23 :'
005000910327     A                                  7 44'24 :'
005100910327     A                                  8 44'25 :'
005200910327     A                                  9 44'26 :'
005300910327     A                                 10 44'27 :'
005400910327     A                                 11 44'28 :'
005500910327     A                                 12 44'29 :'
005600910327     A                                 13 44'30 :'
005700910327     A                                 14 44'31 :'
005800910327     A                                 15 44'32 :'
005900910327     A                                 16 44'33 :'
006000910327     A                                 17 44'34 :'
006100910327     A                                 18 44'35 :'
006200910327     A                                 19 44'36 :'
006300910327     A*
006400910327     A                                 21 30'98 :'
006500910327     A                                 22 30'99 :'
006600910327     A*
006700910327     A                                  4 10''
006800910327     A  01                                  DSPATR(RI)
006900910327     A                                  5 10''
007000910327     A  02                                  DSPATR(RI)
007100910327     A                                  6 10''
007200910327     A  03                                  DSPATR(RI)
007300910327     A                                  7 10''
007400910327     A  04                                  DSPATR(RI)
007500910327     A                                  8 10''
007600910327     A  05                                  DSPATR(RI)
007700910607     A                                  9 10''
007800910607     A  06                                  DSPATR(RI)
007900910327     A**                                9 10''
008000910327     A**06                                  DSPATR(RI)
008100910327     A**                               10 10''
008200910327     A**07                                  DSPATR(RI)
008300910327     A**                               11 10''
008400910327     A**08                                  DSPATR(RI)
008500081222     A                                 10 10''
008600081222     A  07                                  DSPATR(RI)
008700090317     A*09/03/17                        11 10''
008800090317     A**08*3/17                             DSPATR(RI)
008900130522     A                                 11 10''
009000130522     A  08                                  DSPATR(RI)
009100910327     A**************************************************************
009200130508     A*13/05/08                        13 10''
009300130508     A                                 13 10''
009400910327     A  10                                  DSPATR(RI)
009500130508     A*13/05/08                        14 10''
009600130508     A                                 14 10''
009700910327     A  11                                  DSPATR(RI)
009800910327     A**************************************************************
009900910327     A**************************************************************
010000910327     A                                 16 10''
010100910327     A  13                                  DSPATR(RI)
010200910327     A                                 17 10''
010300910327     A  14                                  DSPATR(RI)
010400240530      *ADD STR 20240530 NOS
010500240530     A                                 19 10' FAXFAXIMO'
010600240530     A  16                                  DSPATR(RI)
010700240530      *ADD STR 20240530 NOS
010800910327     A**************************************************************
010900910327     A                                  4 49''
011000910327     A  21                                  DSPATR(RI)
011100910327     A                                  5 49''
011200910327     A  22                                  DSPATR(RI)
011300910327     A                                  6 49''
011400910327     A  23                                  DSPATR(RI)
011500980416     A                                  8 49''
011600910327     A  25                                  DSPATR(RI)
011700980416     A*                                 8 49''
011800980416     A* 25                                  DSPATR(RI)
011900950726     A* 95/07/26
012000950726     A                                 10 49''
012100950726     A  27                                  DSPATR(RI)
012200950726     A                                 11 49''
012300950726     A  28                                  DSPATR(RI)
012400950726     A                                 12 49''
012500950726     A  29                                  DSPATR(RI)
012600170117     A                                 14 49''
012700170117     A  31                                  DSPATR(RI)
012800151214     A                                 15 49''
012900151214     A  32                                  DSPATR(RI)
013000240705     A*24/07/05 N.NOS           *
013100240705     A                                 17 49''
013200240705     A  34                                  DSPATR(RI)
013300910327     A*
013400910327     A                                 21 35''
013500910327     A                                 22 35''
013600910327     A            XSEL           2   B 24 30CHGINPDFT(CS) DSPATR(HI)
013700910327     A                                 24 33': '
