000100051027     A****************************************************************
000200240306     A**  **    **                 *
000300240306     A**                                    CREATE  :  24/03/06      *
000400051027     A**                                                             *
000500240306     A**    PROG-ID : TMN49FM               WRITER  :  NOS           *
000600240522     A****************************************************************
000700240522     A*24/05/22 NOS KAMATA 
000800240610     A*24/06/10 NOS NISHIGAKI 35,36
000900240614     A*24/06/14 NOS NISHIGAKI 15,16
001000080911     A****************************************************************
001100000000     A                                      PRINT
001200240306     A          R TMN49R
001300240306     A                                  1  2'TMN49'
001400240306     A                                  1 21'+
001500000000     A                                      '
001600000000     A                                      DSPATR(RI HI)
001700051027     A                                  1 59DATE EDTCDE(9)
001800051028     A                                  1 68TIME
001900051028     A            XWSID          4      1 77
002000000000     A                                  4  5'01 :'
002100000000     A                                  5  5'02 :'
002200000000     A                                  6  5'03 :'
002300000000     A                                  7  5'04 :'
002400000000     A                                  8  5'05 :'
002500000000     A                                  9  5'06 :'
002600000000     A                                 10  5'07 :'
002700000000     A                                 11  5'08 :'
002800000000     A                                 12  5'09 :'
002900000000     A                                 13  5'10 :'
003000000000     A                                 14  5'11 :'
003100000000     A                                 15  5'12 :'
003200000000     A                                 16  5'13 :'
003300000000     A                                 17  5'14 :'
003400000000     A                                 18  5'15 :'
003500000000     A                                 19  5'16 :'
003600000000     A*
003700000000     A                                  4 44'21 :'
003800000000     A                                  5 44'22 :'
003900000000     A                                  6 44'23 :'
004000000000     A                                  7 44'24 :'
004100000000     A                                  8 44'25 :'
004200000000     A                                  9 44'26 :'
004300000000     A                                 10 44'27 :'
004400000000     A                                 11 44'28 :'
004500000000     A                                 12 44'29 :'
004600000000     A                                 13 44'30 :'
004700000000     A                                 14 44'31 :'
004800000000     A                                 15 44'32 :'
004900000000     A                                 16 44'33 :'
005000000000     A                                 17 44'34 :'
005100000000     A                                 18 44'35 :'
005200000000     A                                 19 44'36 :'
005300000000     A*
005400000000     A                                 21 30'98 :'
005500000000     A                                 22 30'99 :'
005600000000     A*
005700240307     A                                  4 10''
005800051027     A  01                                  DSPATR(RI)
005900240306     A                                  5 10''
006000051027     A  02                                  DSPATR(RI)
006100240306     A                                  6 10''
006200051027     A  03                                  DSPATR(RI)
006300161202     A                                  7 10'                      '
006400051027     A  04                                  DSPATR(RI)
006500240306     A                                  8 10'                      '
006600240306     A  05                                  DSPATR(RI)
006700240306     A                                  9 10'                      '
006800240306     A  06                                  DSPATR(RI)
006900240306     A                                 10 10'                      '
007000240306     A  07                                  DSPATR(RI)
007100240306     A                                 11 10'                      '
007200240306     A  08                                  DSPATR(RI)
007300240306     A                                 12 10'                      '
007400080911     A  09                                  DSPATR(RI)
007500161202     A                                 13 10'                      '
007600080911     A  10                                  DSPATR(RI)
007700161202     A                                 14 10'                      '
007800080911     A  11                                  DSPATR(RI)
007900240614     A*24/06/14 NOS NISHIGAKI 15
008000240614     A                                 18 10''
008100240614     A  15                                  DSPATR(RI)
008200240614     A*24/06/14 NOS NISHIGAKI 16
008300240614     A                                 19 10''
008400240614     A*                                19 10'NB'
008500240614     A  16                                  DSPATR(RI)
008600051027     A*
008700240306     A                                  4 49''
008800051027     A  21                                  DSPATR(RI)
008900240306     A                                  5 49''
009000051027     A  22                                  DSPATR(RI)
009100240306     A                                  6 49''
009200161202     A  23                                  DSPATR(RI)
009300240306     A                                  7 49''
009400051027     A  24                                  DSPATR(RI)
009500240522     A***                               8 49''
009600240522     A                                  8 49''
009700240306     A  25                                  DSPATR(RI)
009800240522     A                                  9 49''
009900240306     A  26                                  DSPATR(RI)
010000240610     A*24/06/10 NOS NISHIGAKI  
010100240610     A                                 11 49'                      '
010200240610     A  28                                  DSPATR(RI)
010300240610     A                                 12 49'                      '
010400051027     A  29                                  DSPATR(RI)
010500161202     A                                 13 49'                      '
010600051027     A  30                                  DSPATR(RI)
010700161202     A                                 14 49'                      '
010800051027     A  31                                  DSPATR(RI)
010900161202     A                                 15 49'                      '
011000240306     A  31                                  DSPATR(RI)
011100240306     A                                 15 49'                      '
011200051027     A  32                                  DSPATR(RI)
011300161202     A                                 16 49'                      '
011400051027     A  33                                  DSPATR(RI)
011500240610     A*24/06/10 NOS NISHIGAKI    
011600240610     A                                 18 49''
011700240610     A  35                                  DSPATR(RI)
011800240610     A                                 19 49''
011900240610     A  36                                  DSPATR(RI)
012000000000     A*
012100000000     A                                 21 35''
012200000000     A                                 22 35''
012300000000     A            XSEL           2   B 24 30CHGINPDFT(CS) DSPATR(HI)
012400000000     A                                 24 33': '
